{
    "content": [
        {
            "type": "introduction",
            "content": [
                "SECURITIES AND EXCHANGE COMMISSION\n                             WASHINGTON, D.C. 20549\n                    -----------------------------------------\n\n                                    FORM 10-K\n(Mark One)\n\n  [X]  Annual report pursuant to section 13 or 15(d) of the Securities Exchange\n       Act of 1934 [Fee Required]\n\n  For the fiscal year ended June 30, 1999 or\n\n  [ ] Transition report pursuant to Section 13 or 15(d) of Securities Exchange\n      Act of 1934 [Fee Required]\n\nFor the transition period from ___________ to _________\n\nCommission File Number 1-5893\n\n                                MOVIE STAR, INC.\n             (Exact name of Registrant as specified in its Charter)\n\n\n                       New York                           13-5651322\n           (State or other jurisdiction of             (I.R.S. Employer\n            incorporation or organization)             Identification No.)\n\n           136 Madison Avenue, New York, NY                   10016\n                 (Address of Principal                      (Zip Code)\n                  Executive Offices)\n\nRegistrant's telephone number including area code  (212) 684-3400\n\nSecurities registered pursuant to Section 12(b) of the Act:\n\n\nTitle of each class                   Name of each exchange on which registered\n\nCommon Stock, $.01 par value          American Stock Exchange\n$25,000,000 12.875% Debenture         American Stock Exchange\ndue October 1, 2001\n\nSecurities registered pursuant to Section 12(g) of the Act:\n\n                                      None\n                                (Title of Class)\n\nIndicate by check mark whether the Registrant (1) has filed all reports required\nto be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during\nthe preceding 12 months (or for such shorter period that the Registrant was\nrequired to file such reports), and (2) has been subject to such filing\nrequirements for the past 90 days.\n\n                  Yes        [ X ]               No     [  ]\n\nIndicate by check mark if disclosure of delinquent filers pursuant to Item 405\nof Regulation S-K is not contained herein, and will not be contained, to the\nbest of Registrant's knowledge, in definitive proxy or information\n\n\n\nstatements incorporated by reference in Part III of this Form 10-K or any\namendment to this Form 10-K.\n\n                  Yes          X                     No\n\nThe aggregate market value of voting stock held by nonaffiliates of the\n Registrant totalled $12,818,264 on August 31, 1999, based upon the closing\n price of $1.375 at the close of trading on August 31, 1999.\n\nAs of August 31, 1999, there were 14,879,644 common shares outstanding.\n\n\n                       DOCUMENTS INCORPORATED BY REFERENCE\n\nSEE Item 14 with respect to exhibits to this Form 10-K which are incorporated\nherein by reference to documents previously filed or to be filed by the\nRegistrant with the Commission.\n\n<PAGE>\n\n                                MOVIE STAR, INC.\n                          1999 FORM 10-K ANNUAL REPORT\n                                TABLE OF CONTENTS\nitem1\nitem2\nitem3\nVote of Security Holders..................... I-7\nRelated Stockholder Matters..................II-1\nitem6\nof Financial Condition and\n .                          Results of Operations........................II-3\nSupplementary Data.........................   F-1\nFinancial Disclosure.........................II-14\nof the Company..............................III-1\nitem11\nOwners and Management.......................III-6\nRelated Transactions........................III-7\nSchedule and Reports on Form 8-K.............IV-1\n\n<PAGE>"
            ]
        },
        {
            "type": "part",
            "text": "parti",
            "content": [
                {
                    "type": "item",
                    "text": "item1",
                    "content": [
                        "\n\nItem 1 red.(a) The Company, a New York corporation organized in 1935, designs,\nmanufactures, markets and sells an extensive line of ladies' sleepwear, robes,\nleisurewear, loungewear, panties and daywear; and also operates retail stores\nunder the names Movie Star Factory Stores, Bargain Box Factory Stores, Bobby's\nPlace, Bobby's Menswear and A Little Xtra from Movie Star (\"Retail Stores\").\nDuring fiscal 1998, the Company exited the men's, women's and children's screen\nprinted tee shirt division.",
                        "\nThe Company's products consist of ladies' pajamas, nightgowns, baby dolls,\nnightshirts, dusters, shifts, caftans, sundresses, rompers, short sets,\nbeachwear, peignoir ensembles, robes, leisurewear, panties, and daywear\nconsisting of bodysuits, soft bras, slips, half-slips, teddies and camisoles.\nThese products are manufactured in various fabrics, designs, colors and styles\ndepending upon seasonal requirements, changes in fashion and customer demand.",
                        "\nThe products sold in the Company's retail stores consist of lingerie,\nloungewear, sportswear, outerwear and hosiery for regular and plus size women,\nselect menswear, jewelry and accessories. The specific products offered depend\non the buying opportunities that are available each season.\n\nBetween 1992 and 1997, as a result of consolidations in the retail industry, the\nhigh cost of domestic manufacturing and difficulties the Company had encountered\nin engaging reliable offshore contractors and obtaining sufficient quantities of\nacceptable quality finished products from overseas, the Company experienced a\nloss of sales to certain of its customers. In fiscal 1998, the Company began to\nregain a portion of the sales it had lost by creating new designs at competitive\nprices and by improving on-time delivery and the quality of its products. The\nCompany has shifted a large portion of its production to Mexico and other\noffshore based contractors and has developed infrastructures in these locations\nthat has given the Company greater control over its operations, quality and\non-time delivery. The Company maintains an in-house design staff which affords\nit the flexibility to work with merchandise buyers on fashion design and price\npoints and its remaining domestic manufacturing facilities allow shorter \"lead\ntimes\" in producing certain of its products.\n\n(b) Intentionally omitted.\n\n(c) (i) The Company's products are sold to discount, specialty, national and\nregional chain, mass merchandise and department stores and direct mail catalog\nmarketers throughout the United States. The prices to consumers for the\nCompany's products range from approximately $3.00 for certain of its panty\nproducts to approximately $110.00 for certain other products, such as peignoir\nsets. The Company's products are sold by in-house sales personnel and outside\nmanufacturer's representatives. Approximately 54% of the Company's sales are\nmade to national chains and mass merchandisers; the balance of the Company's\nsales are unevenly distributed among discount, specialty, department and\nregional chain stores, direct mail catalog marketers and to consumers through\nthe Company's Retail Stores. The Company's gross profit on its sales for each of\nthe fiscal years ended June 30, 1999, 1998 and 1997 was approximately 29%, 29%\nand 27%, respectively.\n\nThe Retail Stores primarily sell apparel products manufactured by the Company\nand other manufacturers at discounted retail prices. The prices to consumers for\nthe products sold in the Retail Stores range from approximately $.49 for hosiery\nto $79.00 for outerwear. During the early to mid 90's, the Retail Stores began\nto shift the mix of products sold from primarily non-branded first quality\ncloseouts and irregular merchandise at discounted prices to selling branded\nmerchandise, first quality non-branded merchandise and to a much lesser extent,\nirregular merchandise at discounted prices. In fiscal 1999, 1998 and 1997 less\nthan 5%, 15% and 20%, respectively, of the products sold by these stores were\nsupplied by the Company. This decrease resulted primarily from the phase out of\nthe Company's popular-priced trade business and the Company's decision to\ndiversify and broaden the Retail Stores product line. The Retail Stores\naccounted for approximately 13.1%, 16.6% and 16.7% of the Company's total sales\nin fiscal 1999, 1998 and 1997, respectively. These stores operate at a gross\nprofit above 33%. The Retail Stores division advertises directly to consumers\nthrough print, radio and television in the localities in which it operates.\n\n                                       I-1\n\n\n\nThe Company limits the promotion of its manufactured products to cooperative\nadvertising in conjunction with its retail customers directed to the ultimate\nretail consumer of its products.\n\nFrom 1976 until 1998, the Company had, pursuant to various written agreements,\nretained Harold Shatz and Jeffrey Hymowitz and their organization, Domino\nIndustries, Inc. (\"Domino\"), as a manufacturer's representative. In fiscal 1998,\nMr. Shatz effectively discontinued providing his services as a sales executive\nto the Domino organization and did not wish to resume providing those services.\nIn view of this fact, the Company and Domino agreed to modify their agreement.\nUnder the modification, Domino accepted significantly lower commissions on the\nnet sales attributable to its sales efforts in consideration for the Company's\npayment of a negotiated fixed fee payable in monthly installments until the\nexpiration of the agreement on December 31, 1998. Mr. Hymowitz became an\nemployee of the Company upon the expiration of the agreement. Working closely\nwith the Company, Mr. Hymowitz has continued to sell to certain accounts under\nthe supervision of Mel Knigin, the Company's President and most senior executive\nin charge of sales and merchandising. In fiscal year 1999 and 1998,\napproximately 36% and 30%, respectively, of the Company's net sales were\nattributed to Mr. Hymowitz and the Domino organization. The Company believes\nthat the loss of its relationship with Mr. Hymowitz would not materially\nadversely affect the Company because retailers' purchasing decisions are\nprimarily based upon the Company's products.\n\n(ii)  Not applicable.\n\n(iii) The Company utilizes a large variety of fabrics made from natural and\nman-made fibers including, among others, polyester, cotton, broadcloth, stretch\nterry, brushed terry, flannel, brushed flannel, nylon, spun polyester, velour,\nsatins, tricot, jersey, fleece, jacquards, lace, stretch lace, charmeuse,\nchambray, and various knit fabrics.\n\nThese materials are available from a variety of both domestic and foreign\nsources. The sources are highly competitive in a world market. The Company\nexpects these competitive conditions to continue in the foreseeable future.\nGenerally, the Company has long-standing relationships with its domestic and\nforeign suppliers and purchases its raw materials in anticipation of orders or\nas a result of need based on orders received. Purchase of raw materials in high\nvolume provides the Company with the opportunity to buy at relatively low\nprices. In turn, the Company is able to take advantage of these lower prices in\nthe pricing of its finished goods.\n\nThe amount of finished goods assembled for the Company in the Caribbean and\nCentral America has increased from 13% in fiscal 1997 and 1998 to 16% in fiscal\n1999. The Company has also increased the amount of finished goods assembled in\nMexico from 9% in fiscal 1997 and 34% in fiscal 1998 to 48% in fiscal 1999.\n\nThe increases in Mexico were due to the Company's strategic decision to assemble\nmore of its finished goods in that country in order to take advantage of lower\nlabor costs and lower duty rates resulting from the North American Free Trade\nAgreement (\"NAFTA\"). Certain of the raw materials used in the production of the\nCompany's products in Mexico are subject to export limitations under NAFTA,\ncalled Tariff Protection Levels (\"TPL\"), that are similar to quotas. TPL is\nassigned annually to various categories of textiles and is available on a\n\"first-come first-served\" basis to U.S. companies exporting products from Mexico\ncontaining the textiles subject to the TPL. In September 1998 and June 1999, the\nmaximum annual TPL for certain of the raw materials used in the Company's\nproducts was exhausted. As a result, the rate of duty on the affected products\nfrom Mexico shipped to the United States in the last four months of calendar\nyear 1998 and the last six months of calendar year 1999 increased from 2.8% in\n1998 and no duty in 1999 to 16.6% of the value of the finished product. The\nCompany has investigated various alternatives to minimize the impact of this\nincrease, including the shift of a portion of its production to other locations,\nsuch as the Philippines. Approximately 15% of the Company's finished goods were\nimported from foreign sources in fiscal 1999 as compared to 10% in fiscal 1998\nand 20% in fiscal 1997. In fiscal 1999, approximately 33% of the Company's raw\nmaterials were imported as compared to approximately 37% in fiscal 1998 and 33%\nin fiscal 1997.\n\nThe functions of purchasing finished products and raw materials from offshore\nsources have been centralized to give the Company greater control over its\noffshore purchases through closer oversight of these functions by senior\nmanagement and greater accountability from foreign based personnel employed by\n\n                                       I-2\n\n\n\n\nand reporting directly to the Company. Currently, the Company has two employees\nin Bangladesh and two employees in the Philippines supervising the production of\nfinished products purchased by the Company from manufacturers in those\ncountries.\n\nAs a result of the Company's decision to shift a large portion of its production\nto Mexico-based contractors, the Company has developed an infrastructure with\nnine employees in Mexico to assure greater control over its operations and\nassist in maintaining quality and on-time delivery. The Company also has two\nemployees in Honduras who assist in maintaining quality and on-time delivery.\nManagement personnel travel to Mexico, the Far East, the Caribbean and Central\nAmerica throughout the year to monitor the performance of the Company's offshore\nmanufacturers and contractors.\n\nThe Company's transactions with its foreign manufacturers and suppliers are\nsubject to the risks of doing business abroad. The Company's import and offshore\noperations are subject to constraints imposed by agreements between the United\nStates and a number of foreign countries in which the Company does business.\nThese agreements impose quotas on the amount and type of goods that can be\nimported into the United States from these countries. Such agreements also allow\nthe United States to impose, at any time, restraints on the importation of\ncategories of merchandise that, under the terms of the agreements, are not\nsubject to specified limits. The Company's imported products are also subject to\nUnited States customs duties and, in the ordinary course of business, the\nCompany is from time to time subject to claims by the United States Customs\nService for duties and other charges. The United States and other countries in\nwhich the Company's products are manufactured may, from time to time, impose new\nquotas, duties, tariffs or other restrictions, or adversely adjust presently\nprevailing quotas, duty or tariff levels, which could adversely affect the\nCompany's operations and its ability to continue to import products at current\nor increased levels. The Company cannot predict the likelihood or frequency of\nany such events occurring.\n\nThe Company believes it maintains adequate inventories to cover the needs of its\ncustomers.\n\n(iv) The Company has several registered trademarks, of which \"Movie Star\",\n\"Movie Star Loungewear\", \"Cinema Etoile\", \"Cine Jour\", \"Private Property\", and\n\"Night Magic\" are material to the marketing by the Company of its products.\nThere is no litigation with respect to patents, licenses and trademarks.\n\nThe Company has entered into an exclusive licensing agreement to produce and\nsell sleepwear and intimate apparel designed by Flora Nikrooz. The Company has\nintroduced a designer collection at affordable prices that have been designed by\nMs. Nikrooz under the Flora Nikrooz intimates name. These products are being\noffered to department and better specialty stores. The Company plans to ship the\nfirst orders in November 1999.\n\n (v) The Company manufactures a wide variety of intimate apparel in many\ndifferent styles and sizes and for use in all seasons and climates in the United\nStates. Because of its product mix, it is subject to certain seasonal variations\nin sales and in the utilization of its manufacturing facilities. More than 50%\nof the Company's sales are made in the first six months of its fiscal year.\n\n(vi) All sales are outright sales. Terms are generally net 10 days E.O.M. or net\n30 days from the date the goods are shipped which, depending on date of\nshipment, can be due from as short a period as twenty-one days or as long as\nfifty days. It has become industry practice to extend payment terms up to an\nadditional thirty days for certain customers. Although sales are made without\nthe right of return, in certain instances the Company may accept returns or\nagree to allowances. The Company maintains sufficient inventories of raw\nmaterials and finished goods to meet its production requirements and the\ndelivery demands of its customers. As a result, the Company relies on its\nshort-term line of credit to supplement internally generated funds to fulfill\nits working capital needs.\n\n(vii) Wal-Mart accounted for 22% of sales for fiscal 1999 and 20% of sales for\nfiscal 1998. Sears, Roebuck and Company accounted for 14% of sales for fiscal\n1999 and 11% of sales for fiscal 1998. Target accounted for 11% of sales for\nfiscal 1999 and 3% of sales for fiscal 1998.\n\nPurchasing decisions by the Company's customers with respect to each group of\nthe Company's products and, in some instances, products within a group,\ngenerally are made by different buyers and purchasing departments. The\n\n                                      I-3\n\n\n\nCompany believes that the loss of orders from any one buyer or purchasing\ndepartment would not necessarily result in the loss of sales to other buyers or\npurchasing departments of those customers.\n\n(viii) The backlog of orders as of June 30, 1999 was approximately $32,300,000\nand as of June 30, 1998 was approximately $33,000,000. Orders are booked upon\nreceipt. The Company believes that the current backlog is firm and will be\nfilled by the end of the current fiscal year.\n\n(ix) There is no material portion of the business which may be subject to\nrenegotiation of profits or termination of contracts or subcontracts at the\nelection of the Government.\n\n(x) The intimate apparel business is fragmented and highly competitive. The\nindustry is characterized by a large number of small companies manufacturing and\nselling unbranded merchandise, and by several large companies which have\ndeveloped widespread consumer recognition of the brand names associated with\nmerchandise manufactured and sold by these companies. In addition, certain of\nthe larger retailers to whom the Company has historically sold its products have\nsought to expand the development and marketing of their own brands and to obtain\nintimate apparel products directly from similar sources as the Company.\n\nOwning manufacturing facilities has required the investment of substantial\ncapital and subjected the Company to the costs of maintaining excess capacity.\nCompetitive conditions in the industry have required the Company to place\ngreater reliance on obtaining raw materials and finished products from sources\noutside the United States. As a result, the Company has consolidated production\nin its domestic plants by closing underutilized and inefficient facilities.\nBetween August 1990 and June 1998, the Company has closed seventeen\nmanufacturing plants in an effort to lower costs by reducing excess\nmanufacturing capacity and in response to the need to produce and purchase\nproducts at a lower cost from sources outside the United States.\n\nThe intimate apparel industry is further characterized by competition on the\nbasis of price, quality, efficient service and prompt delivery. Because of this\ncompetitive pressure, the Company no longer relies principally on domestic\nmanufacturing and has increased its reliance on offshore manufacturers and\ncontractors. Accordingly, changes in import quotas, currency valuations and\npolitical conditions in the countries from which the Company imports products\ncould adversely affect the Company's business. Such shifts could also result in\nthe underutilization of the Company's remaining domestic plants and decrease\nprofitability.\n\n(xi) No material research activities relating to the development of new products\nor services or the improvement of existing products or services were undertaken\nduring the last fiscal year, except for the normal continuing development of new\nstyles and marketing methods.\n\n(xii) There are no costs relating to complying with environmental regulations in\nthe fiscal year just completed or over future periods of which the Company is\naware.\n\n(xiii) Of the approximately 588 employees of the Company, approximately 22 are\nexecutive, design and sales personnel, 115 are administrative personnel, and the\nbalance are in manufacturing, warehousing and retail sales for the Retail Stores\ndivision. In addition, the Company employs approximately 55 part-time sales and\nstockroom assistants in its Retail Stores division.\n\nThe Company has never experienced an interruption of its operations because of a\nwork stoppage. Even though the Company is subject to certain seasonal variations\nin sales, significant seasonal layoffs are rare.\n\nMost employees have an interest in the Company's Common Stock through the\nCompany's ESOP. The Company deems its relationship with its employees to be\ngood. The Company is not a party to any collective bargaining agreement with any\nunion.\n\n\n                                       I-4\n\n\n\n\nRestriction on Dividends\n\nPursuant to a public offering of $25,000,000 of Debentures in 1986, and the\nexchange in October 1996 of certain of those Debentures for New Senior Notes,\nthe Company may not declare or pay any dividend or make any distribution on any\nclass of its capital stock except dividends or distributions payable in capital\nstock of the Company or to the holders of any class of its capital stock, or\npurchase, redeem or otherwise acquire or retire for value any capital stock of\nthe Company if (i) at the time of such action an event of default, or an event\nwhich with notice or lapse of time or both would constitute an event of default,\nshall have occurred and be continuing, or (ii) if, upon after giving effect to\nsuch dividend, distribution, purchase, redemption, other acquisition or\nretirement, the aggregate amount expended for all such purposes subsequent to\nJune 30, 1986, shall exceed the sum of (a) 75% of the aggregate consolidated net\nincome of the Company earned subsequent to June 30, 1986, (b) the aggregate net\nproceeds, including the fair market value of property other than cash received\nby the Company from the issue or sale after September 30, 1986 of capital stock\nof the Company, including capital stock issued upon the conversion of, or in\nexchange for, indebtedness for borrowed money and (c) $4,000,000; provided,\nhowever, that the provisions of this limitation shall not prevent the retirement\nof any shares of the Company's capital stock by exchange for, or out of proceeds\nof the substantially concurrent sale of, other shares of its capital stock, and\nneither such retirement nor the proceeds of any such sale or exchange shall be\nincluded in any computation made under this limitation.\n\n\n                                       I-5\n\n\n\n\nITEM 2.                                        PROPERTIES\n\n    The following table sets forth all of the facilities owned or leased by the\nCompany as of June 30, 1999.\n\n<TABLE>\n                                    Owned or        Bldg. Area                  Expiration   Productive    Extent of\nLocation           Use              Leased           (sq. ft.)   Annual Rent    of Lease     Capacity(4)   Utilization(4)\n--------                            ------           ---------   -----------    --------     -----------   --------------\n<S>                <C>              <C>               <C>        <C>            <C>          <C>           <C>\n136 Madison Ave.,  Executive and    Portions Sub-       23,000   $393,000       4/01         N/A           N/A\nNew York, NY       Administrative   leased;                      (1)\n(includes one      offices;         Portions\nfloor at 148       divisional sales Leased\nMadison Ave.,      office and       Directly from\nNY, NY)            showroom         Landlord\n\n180 Madison Ave.,  Sales Office     Leased               3,000   $ 65,000       7/00         N/A           N/A\nNew York, NY       and Showroom\n\n\nPetersburg, PA     Warehousing      Owned              140,000     _____        _____        N/A           N/A\n                   for finished\n                   goods; dis-\n                   tribution center\n\nLebanon, VA        Manufacturing;   Owned              170,000     _____        _____        250           91%\n                   warehousing for\n                   piece goods and\n                   finished goods;\n                   distribution\n                   center\n\nHonaker, VA        Vacant           Owned               40,000     _____        _____        N/A           N/A\n\n\nSouth Mississippi  1 Mfg./Dist./    Owned/Leased       239,000     _____        _____        200           28%(5)\n                   Warehouse; 1     (2)\n                   Distribution\n                   Center\n\nNorth Mississippi  1 Mfg./Vacant    Owned              103,000     _____        _____        N/A           N/A\n\nRetail Stores      28 retail        Leased(3)          103,000   $360,000(3)    (3)         N/A            N/A\n                   stores located\n                   throughout\n                   Mississippi and\n                   Georgia\n</TABLE>\n\n----------\n         (1) Includes escalation for 1999.\n\n         (2) Leased from municipalities pursuant to local Development Authority\nbond issues.\n\n         (3) Store leases generally are for one to three-year periods with\noptions to renew. Rents generally range from $2-$8 per square foot.\n\n         (4) \"Productive Capacity\" is based on the total number of employees\nthat can be employed at a facility providing direct labor for the manufacture of\nthe Company's products based on existing machinery and equipment and plant\ndesign. \"Extent of Utilization\" is the percentage obtained by dividing the\naverage number of employees actually employed at a facility during the fiscal\nyear providing direct labor for the manufacture of the Company's products by\nProductive Capacity.\n\n                                       I-6\n\n\n\n         (5) Subsequent to June 30, 1998, the Company has minimized the amount\nof production it does at this facility in order to maximize its overall\nefficiency, lower manufacturing costs and to allow for more warehousing and\ndistribution space.\n\n\n         The following table sets forth the amount of space allocated to\ndifferent functions in shared facilities set forth in the preceding table.\n\n\n                                                                       AMOUNT\n                                                                       OF SPACE\nLOCATION                      FUNCTION                                 (Sq. ft.)\n--------                      --------                                 ---------\n\n136, 148 and 180              Corporate Offices;                           7,000\nMadison Avenue                Divisional Sales Offices\nNew York, New York            and Showrooms;                              11,000\n                              Production Staff and Design                  8,000\n\nPetersburg, Pennsylvania      Warehousing and Distribution;              137,000\n                              Offices                                      3,000\n\nLebanon, Virginia             Manufacturing;                              49,000\n                              Warehousing and Distribution;              111,000\n                              Offices                                     10,000\n\n\nMississippi                   Manufacturing;                              29,000\n                              Manufacturing and Distribution;            195,000\n                              Offices                                     15,000"
                    ]
                },
                {
                    "type": "item",
                    "text": "item3",
                    "content": [
                        "\nThere are no legal proceedings pending which are material."
                    ]
                },
                {
                    "type": "item",
                    "text": "item4",
                    "content": [
                        "\nNone.\n\n                                       I-7\n\n"
                    ]
                }
            ]
        },
        {
            "type": "part",
            "text": "partii",
            "content": [
                {
                    "type": "item",
                    "text": "item5",
                    "content": [
                        "                        AND RELATED STOCKHOLDER MATTERS\n\nThe Common Stock is traded on the American Stock Exchange. The following table\nsets forth for the indicated periods the reported high and low prices per share.\n\n                                                           High        Low\n                                                           ----        ---\n\nYear Ended June 30, 1999\nFirst Quarter . . . . . . . . . . . . . . . . . . . . .    11/16       7/16\nSecond Quarter. . . . . . . . . . . . . . . . . . . . .    1 3/4        3/8\nThird Quarter . . . . . . . . . . . . . . . . . . . . .    2 1/4      1 1/8\nFourth Quarter. . . . . . . . . . . . . . . . . . . . .  2 13/16     1 5/16\n\n\nYear Ended June 30, 1998\nFirst Quarter . . . . . . . . . . . . . . . . . . . . .    13/16        3/8\nSecond Quarter. . . . . . . . . . . . . . . . . . . . .      7/8       9/16\nThird Quarter . . . . . . . . . . . . . . . . . . . . .      7/8       9/16\nFourth Quarter. . . . . . . . . . . . . . . . . . . . .      7/8      11/16\n\n\nAs of August 31, 1999, there were approximately 891 holders of record of the\nCommon Stock. For restrictions on dividends, see Item 1 at page I-5.\n\n               MARKET FOR COMPANY'S 12.875% SUBORDINATED DEBENTURE\n                             (per $1,000 par value)\n\n\n                                                           High        Low\n                                                          ------       ----\nYear Ended June 30, 1999\nFirst Quarter . . . . . . . . . . . . . . . . . . . .     940.00     860.00\nSecond Quarter. . . . . . . . . . . . . . . . . . . .     950.00     820.00\nThird Quarter . . . . . . . . . . . . . . . . . . . .     950.00     861.25\nFourth Quarter. . . . . . . . . . . . . . . . . . . .     955.00     900.00\n\n\nYear Ended June 30, 1998\nFirst Quarter . . . . . . . . . . . . . . . . . . . .     837.50      750.00\nSecond Quarter. . . . . . . . . . . . . . . . . . . .     910.00      810.00\nThird Quarter . . . . . . . . . . . . . . . . . . . .     980.00      900.00\nFourth Quarter. . . . . . . . . . . . . . . . . . . .     947.50      915.00\n\n                                      II-1\n\n"
                    ]
                },
                {
                    "type": "item",
                    "text": "item6",
                    "content": [
                        "\n\nMOVIE STAR,  INC. AND SUBSIDIARIES",
                        "(In Thousands, Except Per Share Amounts)\n________________________________________________________________________________",
                        {
                            "type": "table",
                            "content": [
                                "\n Statement of Operations Data:                                   Fiscal Year Ended June 30,\n                                                   1999         1998        1997        1996       1995\n<S>                                             <C>         <C>         <C>         <C>         <C>\n NET SALES                                      $  72,506   $  64,537   $  61,470   $  84,115   $ 101,946\n                                                ---------   ---------   ---------   ---------   ---------\n\n COST OF SALES                                     51,363      45,777      44,947      66,993      81,261\n\n SELLING, GENERAL AND ADMINISTRATIVE\n EXPENES                                           15,859      15,206      13,875      17,637      20,645\n\n LOSS ON ABANDONMENT OF LEASED PREMISES                --          --          --       1,070          --\n\n SPECIAL CHARGE                                        --          --          --         --          750\n                                                 --------    ---------     -------   ---------   --------\n                                                   67,222      60,983      58,822      85,700     102,656\n                                                 --------    ---------     -------   ---------   --------\n INCOME (LOSS) FROM OPERATIONS                      5,284       3,554       2,648      (1,585)       (710)\n\n GAIN ON PURCHASES OF SUBORDINATED\n DEBENTURES AND SENIOR NOTES                           --        (157)       (560)         --          --\n\n INTEREST INCOME                                     (118)       (130)       (157)       (110)       (104)\n\n INTEREST EXPENSE                                   2,694       2,623       2,781       3,893       4,669\n                                                 --------    ---------     -------   ---------   --------\n\n\n INCOME (LOSS) BEFORE PROVISION FOR\n (BENEFIT FROM) INCOME TAXES                        2,708       1,218         584      (5,368)     (5,275)\n\n PROVISION FOR (BENEFIT FROM) INCOME\n TAXES                                                 35          16          65         (90)       (246)\n                                                 --------    ---------     -------   ---------   --------\n\n NET INCOME (LOSS)                               $  2,673    $  1,202      $  519     $(5,278)   $ (5,029)\n                                                 ========    ========      =======   =========   ========\n\n BASIC INCOME (LOSS) PER SHARE                      $ .19       $ .09       $ .04      $ (.38)     $ (.36)\n                                                 ========    ========      =======   =========   ========\n DILUTED INCOME (LOSS) PER SHARE                    $ .17       $ .08       $ .04      $ (.38)     $ (.36)\n                                                 ========    ========      =======   =========   ========\n\n BASIC WEIGHTED AVERAGE NUMBER OF\n SHARES OUTSTANDING                                14,309      14,049      13,960      13,960      13,960\n                                                 ========    ========      =======   =========   ========\n\n DILUTED WEIGHTED AVERAGE NUMBER OF\n SHARES OUTSTANDING                                15,869      15,161      15,868      13,960      13,960\n                                                 ========    ========      =======   =========   ========\n\n\nBalance Sheet Data:                                                        At June 30,\n                                                    1999        1998        1997      1996         1995\n\nWORKING CAPITAL                                 $  22,616   $  19,916   $  18,636   $  19,546   $  22,648\n                                                 ========    ========      =======   =========   ========\nTOTAL ASSETS                                    $  36,759   $  36,743   $  33,957   $  34,610   $  57,204\n                                                 ========    ========      =======   =========   ========\nSHORT-TERM DEBT - Including\n current maturities of long-term debt\n and capital lease obligations                  $      45   $      40   $      73   $      45   $  15,832\n                                                 ========    ========      =======   =========   ========\nLONG-TERM DEBT                                  $  20,703   $  20,980   $  22,336   $  23,533   $  22,496\n                                                 ========    ========      =======   =========   ========\nSTOCKHOLDERS' EQUITY                            $   8,166   $   5,202   $   3,941   $   3,422   $   8,700\n                                                 ========    ========      =======   =========   ========"
                            ]
                        },
                        "\n                                      II-2\n\n<PAGE>"
                    ]
                },
                {
                    "type": "item",
                    "text": "item7",
                    "content": [
                        "\n\n            ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL\n                       CONDITION AND RESULTS OF OPERATIONS\n\nThe following discussion contains certain forward-looking statements with\nrespect to anticipated results which are subject to a number of risks and\nuncertainties. Among the factors that could cause actual results to differ\nmaterially are: business conditions and growth in the Company's industry;\ngeneral economic conditions; the addition or loss of significant customers; the\nloss of key personnel; product development; competition; foreign government\nregulations; fluctuations in foreign currency exchange rates; rising costs of\nraw materials and the unavailability of sources of supply; the timing of orders\nplaced by the Company's customers; and the risk factors listed from time to time\nin the Company's SEC reports.\n\n\nResults of Operations\n\n1999 vs. 1998\n\nNet sales for the year ended June 30, 1999 increased by 12.3% to $72,506,000\nfrom $64,537,000 in the comparable period in 1998. The increase in sales\nresulted from higher sales in the intimate apparel division of approximately\n$9,159,000, offset partially by a decrease in sales for the retail division of\napproximately $1,182,000. Net sales in the intimate apparel division increased\nto $63,006,000 as compared to $53,847,000 in the comparable period in 1998. This\nincrease was primarily due to the retailers' positive acceptance of the\nCompany's moderately priced fashion forward products. At June 30, 1999, the\nCompany's backlog of open orders was $32,300,000 as compared to $33,000,000 at\nJune 30, 1998. Net sales in the Company's retail division decreased to\n$9,500,000 as compared to $10,682,000 in the comparable period in 1998. This\ndecrease was primarily due to poor weather patterns and hurricanes in the\ngeographic areas in which the stores are located, resulting in lower sales due\nto fewer customers.\n\nThe gross profit percentage was 29.2% for the year ended June 30, 1999 as\ncompared to 29.1% for the year ended June 30, 1998. The gross margin in the\nCompany's intimate apparel division increased to 28.0% for the year ended June\n30, 1999 from 27.5% for the year ended June 30, 1998. The higher margins in the\nintimate apparel division resulted primarily from an improved product mix,\nbetter control of product costs and the continued shift of production to\noffshore contractors offset partially by additional duty (see discussion on\nTariff Protection Levels below). The gross margin for the retail division\ndecreased to 37.0% for the year ended June 30, 1999 as compared to 38.2% for the\nyear ended June 30, 1998. The lower margins in the retail division resulted\nprimarily from higher markdowns taken in the current year as compared to the\nprior year, due to the closeout of excess seasonal merchandise that resulted\nfrom an unseasonably warm fall and winter.\n\nCertain of the raw materials used in the production of the Company's products in\nMexico are subject to export limitations under the North American Free Trade\nAgreement, called Tariff Protection Levels (\"TPL\"), that are similar to quotas.\nTPL is assigned annually to various categories of textiles and is available on a\n\n\n                                      II-3\n\n<PAGE>\n\n\"first-come first-served\" basis to U.S. companies exporting products from Mexico\ncontaining the textiles subject to the TPL. In September 1998 and June 1999,\ncertain of the raw materials used in the Company's products reached the maximum\nannual TPL. As a result, the rate of duty for this category of products shipped\nfrom Mexico to the United States, after the annual TPL has been reached,\nincreased from 2.8% in 1998 and no duty in 1999 to 16.6% of the value of the\nfinished product. The Company has investigated various strategies to minimize\nthe impact of this increase. These strategies include purchasing more raw\nmaterials that originate in Mexico that will not be subject to TPL limitations\nand investigating other locations for manufacturing, such as the Philippines.\n\nSelling, general and administrative expenses were $15,859,000, or 21.9% of net\nsales, for the year ended June 30, 1999 as compared to $15,206,000, or 23.6% of\nnet sales, for the similar period in 1998. This increase of $653,000 resulted\nprimarily from increases in salary expense and salary related costs of $678,000\ndue to the hiring of additional personnel and salary increases for existing\npersonnel, a one-time charge of $625,000 in connection with the retirement of\nthe Company's Chief Executive Officer, Mark M. David, an increase in shipping\ncosts of $171,000 and a net increase in other general overhead expenses,\npartially offset by a decrease in commissions of $891,000 and bad debts of\n$291,000. The decrease in commissions was primarily due to the restructuring of\nan agreement the Company had with its outside manufacturer's representative, who\nbecame an employee of the Company on January 1, 1999 and the overall product mix\nof the Company's sales.\n\nThe Company's intimate apparel division had selling, general and administrative\nexpenses of $13,065,00, or 20.7% of net sales, for the year ended June 30, 1999\nas compared to $12,367,000, or 23.0% of net sales, for the similar period in\n1998. This increase in dollars was primarily due to the same reasons described\nabove.\n\nThe Company's retail division had selling, general and administrative expenses\nof $2,794,00, or 29.4% of net sales, for the year ended June 30, 1999 as\ncompared to $2,839,000, or 26.6% of net sales, for the similar period in 1998.\nThis increase in percentage was primarily due to the reduction in sales for the\ndivision.\n\nIncome from operations increased to $5,284,000 for the year ended June 30, 1999,\nfrom $3,554,000 for the similar period in 1998. This increase was due to higher\nsales and gross margins partially offset by an increase in selling, general and\nadministrative expenses.\n\nThe Company's intimate apparel division had income from operations of $4,564,000\nfor the year ended June 30, 1999 as compared to $2,316,000 for the similar\nperiod in 1998. This increase was due to higher sales and gross margins\npartially offset by an increase in selling, general and administrative expenses.\n\nThe Company's retail division had income from operations of $720,000 for the\nyear ended June 30, 1999 as compared to income from operations of $1,238,000 for\n\n                                      II-4\n\n\n\nthe similar period in the prior year. This decrease was due to lower sales and\ngross margins offset partially by lower selling, general and administrative\nexpenses. The operational results for the retail division are based on direct\noperating expenses and do not include any indirect corporate overhead.\n\nIn the second quarter of fiscal 1998, the Company purchased $500,000 in\nprincipal amount of its 12.875% subordinated debentures. As a result of the\ntransaction, the Company recorded a pre-tax gain of $94,000, net of related\ncosts.\n\nIn the third quarter of fiscal 1998, the Company purchased $156,000 and $300,000\nin principal amount of its 12.875% subordinated debentures. As a result of these\ntransactions, the Company recorded a pre-tax gain of $59,000, net of related\ncosts.\n\nInterest income for the year ended June 30, 1999 was $118,000 as compared to\n$130,000 for 1998.\n\nInterest expense for the year ended June 30, 1999 was $2,694,000 as compared to\n$2,623,000 for 1998.\n\nThe Company provided for an income tax provision of $35,000 for the year ended\nJune 30, 1999 as compared to $16,000 for 1998.\n\nThe Company recorded net income for the year ended June 30, 1999 of $2,673,000\nas compared to net income of $1,202,000 for the same period in 1998. This\nincrease of $1,471,000 was due to higher sales and gross margins offset\npartially by an increase in selling general and administrative expenses, a gain\non the purchase of subordinated debentures in the prior year, a net increase in\ninterest costs and a larger provision for income taxes in the current year.\n\n\n1998 vs. 1997\n\nNet sales for the year ended June 30, 1998 increased by 5.0% to $64,537,000 from\n$61,470,000 in the comparable period in 1997. The increase in sales resulted\nfrom higher sales in the intimate apparel division and the retail division of\napproximately $3,311,000 and $453,000, respectively, offset by a decrease in\nother business of $697,000. Net sales in the intimate apparel division increased\nto $53,847,000 from $50,536,000 in the comparable period in 1997. This increase\nwas due to the creation of new designs and competitive products for its\ncustomers. At June 30, 1998 the Company's backlog of open orders was $33,000,000\nas compared to $21,300,000 at June 30, 1997. This increase is due to an expected\nincrease in business for fiscal 1999 and orders being booked earlier than they\nwere in the prior year. Net sales in the Company's retail division increased to\n$10,682,000 from $10,229,000 in the comparable period in 1997. This increase was\nprimarily due to an expanded product line, which includes higher priced brand\n\n\n                                      II-5\n\n<PAGE>\n\nname products. The decrease in other business was the result of the Company's\ndecision to exit the men's, women's and children's screen printed tee shirt\ndivision.\n\nThe gross profit percentage increased to 29.1% for the year ended June 30, 1998\nfrom 26.9% in the similar period in 1997. The gross margin in the Company's\nintimate apparel division increased to 27.5% for the year ended June 30, 1998\nfrom 24.9% in the similar period in 1997. The higher margins in the intimate\napparel division resulted primarily from an improved product mix, better control\nof product costs and the continued shift of a significant portion of production\nto Mexico-based contractors and, to a lesser extent, the elimination of certain\nproblems it had in the prior year with the quality of specific items of the\nCompany's imported finished goods (discussed below). The shift in production to\nMexico-based contractors has enabled the Company to take advantage of lower duty\nrates that result from the North American Free Trade Agreement (\"NAFTA\") and\nshorter lead times associated with the raw materials that are available in\nMexico. The geographic proximity of the Mexico-based contractors also affords\nthe Company's senior management the opportunity to more easily monitor the\nproduction of these products. The Company has seven employees in Mexico to\nsupport this significant shift in production.\n\nThe gross margin for the retail division increased to 38.2% for the year ended\nJune 30, 1998 as compared to 35.7% in the similar period in 1997. The higher\nmargins in the retail division resulted primarily from lower markdowns taken in\nthe current year as compared to the prior year.\n\nAt the end of fiscal 1996 and extending into the second quarter of fiscal 1997,\nthe Company encountered problems with certain of its imported finished goods.\nAfter taking delivery of these goods, the Company was required to correct\nmanufacturing defects before shipping the merchandise to one of the Company's\ncustomers. Although there was no loss of sales attributable to this merchandise,\nthe Company incurred additional costs of approximately $400,000 associated with\ncorrecting the quality problems, which had a negative impact on the financial\nresults for fiscal 1997. In fiscal 1997, the Company replaced the senior\npersonnel responsible for its import department and hired new employees located\nin the Far East to supervise the production of its products. In addition, the\nCompany is now purchasing its products from different manufacturers than it had\nin fiscal 1996 and the first half of fiscal 1997.\n\nSelling, general and administrative expenses increased by $1,331,000 to\n$15,206,000 for the year ended June 30, 1998 from $13,875,000 in the similar\nperiod in 1997. This increase resulted primarily from increases in salary\nexpense and salary related costs, commission expense, a more favorable recovery\nof bad debts in the prior year and an increase in expenses for the retail\ndivision partially offset by a net decrease in other general overhead expenses.\n\nThe Company's intimate apparel division had selling, general and administrative\nexpenses of $12,367,000 for the year ended June 30, 1998 as compared to\n$11,325,000 in the similar period in 1997. This increase was primarily the\nresult of salary expense and salary related expenses increasing approximately\n\n\n                                      II-6\n\n<PAGE>\n\n$481,000 due to the hiring of additional personnel, increases for executive and\nsales personnel as well as increases for administrative personnel. Commission\nexpense increased by $400,000 primarily due to an increase in sales and a\nrestructured agreement with the Company's outside manufacturer's representative,\nwhich included guaranteed commissions in exchange for a significantly reduced\ncommission rate on future sales through the expiration of the agreement,\nDecember 31, 1998. The additional expense incurred in the current fiscal year\ndue to this restructuring was approximately $285,000. The Company also had a\nmore favorable recovery of bad debts in the prior year of approximately $447,000\nprimarily from one customer that resolved its bankruptcy on a more favorable\nbasis than the Company had anticipated.\n\nThe retail division had selling, general and administrative expenses of\n$2,839,000 for the year ended June 30, 1998 as compared to $2,550,000 in the\nsimilar period in 1997. This increase was primarily the result of increases in\nsalary expense and salary related costs, advertising expense and store related\nexpenses totaling approximately $310,000 due to its effort to expand its product\nline with more brand name merchandise and increase sales.\n\nIncome from operations increased to $3,554,000 for the year ended June 30, 1998,\nfrom $2,648,000 for the similar period in 1997. This increase was due to higher\nsales and gross margins partially offset by an increase in selling, general and\nadministrative expenses. The Company's retail division had income from\noperations of $1,238,000 and income from operations of $1,106,000 for the\nsimilar period in the prior year. The operational results for the retail\ndivision are based on direct operating expenses and do not include any indirect\ncorporate overhead.\n\nIn the second quarter of fiscal 1998, the Company purchased $500,000 in\nprincipal amount of its 12.875% subordinated debentures. As a result of the\ntransaction, the Company recorded a pre-tax gain of $94,000, net of related\ncosts.\n\nIn the second quarter of fiscal 1998, the Company purchased $300,000 in\nprincipal amount of its 8% Convertible Senior Notes due September 1, 2001. These\nNotes entitled the previous holders to convert the principal amount into 800,000\nshares of the Company's common stock, par value $.01.\n\nIn the third quarter of fiscal 1998, the Company purchased $156,000 and $300,000\nin principal amount of its 12.875% subordinated debentures. As a result of these\ntransactions, the Company recorded a pre-tax gain of $59,000, net of related\ncosts.\n\nIn the first quarter of fiscal 1997, the Company purchased $1,320,000 in\nprincipal amount of its 12.875% subordinated debentures to meet a sinking fund\npayment due in October 1996. As a result of the transaction, the Company\nrecorded a pre-tax gain of $560,000, net of related costs.\n\n                                      II-7\n\nInterest income for the year ended June 30, 1998 was $130,000 as compared to\n$157,000 for 1997.\n\nInterest expense decreased by $158,000 for the year ended June 30, 1998, from\nthe comparable period in the prior year primarily due to the purchases of a\nportion of the Company's 12.875% subordinated debentures and lower short-term\nborrowing charges.\n\nThe Company provided for an income tax provision of $16,000 for the year ended\nJune 30, 1998 as compared to $65,000 for 1997.\n\nThe Company recorded net income for the year ended June 30, 1998 of $1,202,000\nas compared to net income of $519,000 for the same period in 1997. This increase\nof $683,000 was due to higher sales and gross margins and lower interest costs\noffset partially by an increase in selling general and administrative expenses\nand a larger gain on the purchase of subordinated debentures in the prior year.\n\n\nLiquidity and Capital Resources\n\nFor the year ended June 30, 1999, the Company's working capital increased by\n$2,700,000 to $22,616,000, principally from profitable operations and the sale\nof non-operating assets offset partially by the payment and purchases of\nlong-term debt and the purchase of fixed assets.\n\nDuring the fiscal year ended June 30, 1999, cash increased by $4,051,000. The\nCompany used cash of $528,000 for the purchase of fixed assets, $328,000 for the\nrepayment of short-term borrowings and $50,000 for the payment of capital lease\nobligations. Cash generated from profitable operations, the sale of certain\nnon-operating assets aggregating $200,000 and the exercise of stock options of\n$13,000 principally funded these activities.\n\nReceivables at June 30, 1999 increased by $534,000 to $6,864,000 from $6,330,000\nat June 30, 1998. This increase is due to orders for the Company's intimate\napparel division, being shipped later in fiscal 1999 as compared to the prior\nyear.\n\nInventory at June 30, 1999 decreased by $4,485,000 to $16,460,000 from\n$20,945,000 at June 30, 1998. This decrease resulted in both the intimate\napparel division of approximately $3,941,000 and the retail division of\napproximately $544,000. The decrease in the intimate apparel division was\nprimarily the result of an increase in the amount of finished goods being\npurchased by the Company in fiscal 2000 which did not require the Company to\npurchase and maintain an inventory of the raw materials associated with those\nfinished goods and a reduction in the level of excess and closeout finished\ngoods on hand. The decrease in the retail division resulted from the Company's\ndecision to reduce the level of inventory in this division.\n\n                                      II-8\n\n<PAGE>\n\nDuring the second quarter of fiscal 1999, the Company sold a non-operating\nmanufacturing facility located in Mississippi, a vacant parcel of land located\nin Georgia and other non-operating assets for an aggregate of $200,000.\n\nDuring the third quarter of fiscal 1998, the Company sold its interest in a\nbuilding located in Georgia for approximately $619,000.\n\nDuring the second quarter of fiscal 1998, the Company sold two non-operating\nmanufacturing facilities located in Georgia for an aggregate of $500,000.\n\nIn the second quarter of fiscal 1998, the Company purchased $300,000 in\nprincipal amount of its 8% Convertible Senior Notes due September 1, 2001. These\nNotes entitled the previous holders to convert the principal amount into 800,000\nshares of the Company's common stock, par value $.01. Also in the second quarter\nof fiscal 1998, certain individuals affiliated with the Company purchased\n$278,500 in principal amount of the 8% Convertible Senior Notes due September 1,\n2001. The purchasing affiliates converted the Notes on March 31, 1999 into\n742,662 shares of the Company's common stock, par value $.01. The affiliates\nhave agreed to certain restrictions on the circumstances under which they will\nbe permitted to sell the shares into which the Notes were converted. The\npurchasers have also granted the Company the option to purchase the shares at a\nprice equal to 90% of the market price at the time any purchaser is permitted\nunder the agreement to sell the shares in the open market and wishes to do so.\n\nNon-affiliated holders of $59,000 in principal amount of the Company's 8%\nConvertible Senior Notes converted their Notes into approximately 157,000 shares\nof the Company's common stock in the second quarter of fiscal 1998.\n\nDuring the second quarter of fiscal 1998, the Company purchased $500,000 in\nprincipal amount of its 12.875% subordinated debentures. As a result of the\ntransaction, the Company recorded a pre-tax gain of $94,000, net of related\ncosts.\n\nIn the third quarter of fiscal 1998, the Company purchased $156,000 and $300,000\nin principal amount of its 12.875% subordinated debentures. As a result of these\ntransactions, the Company recorded a pre-tax gain of approximately $59,000, net\nof related costs.\n\nDuring August and September 1999, the Company purchased $2,721,000 in principal\namount of its 12.875% subordinated debentures. As a result of the transaction,\nthe Company will record a pre-tax gain of approximately $105,000, net of related\ncosts, in the first quarter of fiscal 2000. The Company will reduce its\nmandatory sinking fund requirement with these debentures.\n\nThe Company has, after the above purchases, $17,894,000 remaining in long-term\ndebt and a secured revolving line of credit of up to $13,500,000. The long-term\ndebt consists of $7,266,000 of 12.875% Subordinated Debentures, $10,550,000 of\n\n                                      II-9\n\n<PAGE>\n\n8% Senior Notes, and $78,000 of 8% Convertible Senior Notes. The remaining\nsinking fund requirement for the 12.875% Subordinated Debentures is $1,016,000\ndue on October 1, 2000 and the balance of the principal in the amount of\n$6,250,000 is due on October 1, 2001. The 8% Senior Notes and the 8% Convertible\nSenior Notes do not require any amortization and mature on September 1, 2001.\nThe $78,000 of 8% Convertible Senior Notes are convertible into the Company's\ncommon stock, at any time prior to maturity, at a price of $0.375 per share.\n\nThe Company has a secured revolving line of credit of up to $13,500,000, through\nJune 2001, to cover the Company's projected needs for operating capital and\nletters of credit to fund the purchase of imported goods. Direct borrowings\nunder this line bear interest at the annual rate of 2.0% above the prime rate of\nChase Manhattan Bank in fiscal 1999 and the prime rate commencing July 1, 1999.\nAvailability under the line of credit is subject to the Company's compliance\nwith certain agreed upon financial formulas. Under the terms of this financing,\nthe Company has agreed to pledge substantially all of its assets, except the\nCompany's domestic inventory and real property.\n\nManagement believes its available borrowing under its secured revolving line of\ncredit, along with anticipated internally generated funds, will be sufficient to\ncover its working capital requirements.\n\nThe Company has been authorized by the board of directors to make additional\npurchases of its 12.875% Subordinated Debentures to satisfy its October 1, 2000\nsinking fund requirement. The Company does not anticipate making any purchases\nof its stock and anticipates that capital expenditures for fiscal 2000 will be\nless than $700,000.\n\n\nRecently Issued Accounting Standard\n\nRecently Issued Accounting Standard - In June 1998, the Financial Accounting\nStandards Board issued SFAS No. 133, \"Accounting for Derivative Instruments and\nHedging Activities.\" This Statement establishes accounting and reporting\nstandards for derivative instruments and hedging activities. It requires the\nrecognition of all derivatives as either assets or liabilities in the statement\nof financial position and measurement of those instruments at fair value. The\naccounting for changes in the fair value of a derivative is dependent upon the\nintended use of the derivative. SFAS No. 133 will be effective in the Company's\nfirst quarter of the fiscal year ending June 30, 2001 and retroactive\napplication is not permitted. The Company has not yet determined whether the\napplication of SFAS No. 133 will have a material impact on its financial\nposition or results of operations.\n\n                                     II-10\n\n<PAGE>\n\nImports\n\nThe Company's transactions with its foreign manufacturers and suppliers are\nsubject to the risks of doing business abroad. The Company's import and offshore\noperations are subject to constraints imposed by agreements between the United\nStates and a number of foreign countries in which the Company does business.\nThese agreements impose quotas on the amount and type of goods that can be\nimported into the United States from these countries. Such agreements also allow\nthe United States to impose, at any time, restraints on the importation of\ncategories of merchandise that, under the terms of the agreements, are not\nsubject to specified limits. The Company's imported products are also subject to\nUnited States customs duties and, in the ordinary course of business, the\nCompany is from time to time subject to claims by the United States Customs\nService for duties and other charges. The United States and other countries in\nwhich the Company's products are manufactured may, from time to time, impose new\nquotas, duties, tariffs or other restrictions, or adversely adjust presently\nprevailing quotas, duty or tariff levels, which could adversely affect the\nCompany's operations and its ability to continue to import products at current\nor increased levels. The Company cannot predict the likelihood or frequency of\nany such events occurring.\n\n\nYear 2000\n\nOverview\nThe Year 2000 issue is primarily the result of computer programs only accepting\na two-digit date code, as opposed to four digits, to indicate the year.\nBeginning in the Year 2000, and in certain instances prior to the Year 2000,\nthese date code fields will need to accept four digit entries to distinguish\n21st century dates from 20th century dates. As a result, the Company's date\ncritical functions may be adversely affected unless these computer systems and\nsoftware products are, or become, able to accept four-digit entries.\n\nInternal Systems and Equipment\nThe Company has completed its comprehensive program consisting of identifying,\nassessing and, when necessary, upgrading and/or replacing its systems and\nequipment that were vulnerable to Year 2000 problems. The Company has also\nsuccessfully completed the testing of its entire system for Year 2000\ncompliance.\n\nThird Party Relationships\nThe Company has been formally communicating with its significant suppliers and\ncustomers to determine if those parties have appropriate plans to remedy Year\n2000 issues when their systems interface with the Company's systems or may\notherwise impact the operations of the Company. The Company has substantially\ncompleted its review and believes that its major customers and suppliers have\n\n\n                                     II-11\n\n<PAGE>\naddressed their Year 2000 issues. However, there can be no assurance, that the\nsystems of other companies on which the Company's processes rely will be timely\nconverted, or that a failure to successfully convert by another company, or a\nconversion that is incompatible with the Company's systems, would not have an\nimpact on the Company's operations.\n\nContingency Plans\nBased on the assessment efforts to date, the Company has focused on three\nseparate contingency plans (1) if the Company's systems are non-compliant (2) if\nthe Company's customers are non-compliant and (3) if the Company's suppliers are\nnon-compliant. The Company is continuously developing these plans to minimize\nthe impact of a potential failure. However, there can be no assurance that the\nCompany will be able to have a contingency plan in place for a significant\nsupplier and/or customer that does not become Year 2000 compliant.\n\nCosts/Risks\nManagement currently estimates that the cost, in connection with bringing its\nown systems and equipment into compliance, was less than $50,000 for fiscal 1998\nand less than $150,000 for fiscal 1999. Although the Company is not aware of any\nadditional material operational issues or costs associated with preparing its\ninternal systems for the Year 2000, there can be no assurance that there will\nnot be a delay in, or increased costs associated with, the implementation of the\nnecessary systems and changes to address the Year 2000.\n\nPotential sources of risk include but are not limited to (a) the inability of\nprincipal suppliers or the countries in which those suppliers operate to be Year\n2000 compliant, which could result in delays in product deliveries from such\nsuppliers, (b) the inability of our customers to become compliant, which could\nresult in them not accepting our product in a timely manner causing the Company\nto be in an over inventoried position resulting in a disruption of its cash\nflow, and (c) disruption of the distribution channel, including ports and\ntransportation vendors as a result of general failure of systems and necessary\ninfrastructure such as electrical supply.\n\n\n                                     II-12\n\n<PAGE>\n\n              SAFE HARBOR FOR FORWARD-LOOKING STATEMENTS UNDER THE\n                    SECURITIES LITIGATION REFORM ACT OF 1995\n\nExcept for historical information contained herein, this Report on Form 10-K\ncontains forward-looking statements within the meaning of the Private Securities\nLitigation Reform Act of 1995 which involve certain risks and uncertainties. The\nCompany's actual results or outcomes may differ materially from those\nanticipated. Important factors that the Company believes might cause differences\nare discussed in the cautionary statement under the caption \"Management's\nDiscussion and Analysis of Financial Condition and Results of Operations\" in\nthis Form 10-K. In assessing forward-looking statements contained herein,\nreaders are urged to carefully read those statements.\n\n\n                                     II-13\n\n<PAGE>\n\n\nITEM 8.           INDEPENDENT AUDITORS' REPORT\n\n\nTo the Board of Directors and Stockholders of\n   Movie Star, Inc.:\n\nWe have audited the accompanying consolidated balance sheets of Movie Star, Inc.\nand subsidiaries as of June 30, 1999 and 1998, and the related consolidated\nstatements of income, stockholders' equity and cash flows for each of the three\nyears in the period ended June 30, 1999. Our audits also included the financial\nstatement schedule listed in the index at Item 14(a)(2). These financial\nstatements and financial statement schedule are the responsibility of the\nCompany's management. Our responsibility is to express an opinion on these\nfinancial statements and financial statement schedule based on our audits.\n\nWe conducted our audits in accordance with generally accepted auditing\nstandards. Those standards require that we plan and perform the audit to obtain\nreasonable assurance about whether the financial statements are free of material\nmisstatement. An audit includes examining, on a test basis, evidence supporting\nthe amounts and disclosures in the financial statements. An audit also includes\nassessing the accounting principles used and significant estimates made by\nmanagement, as well as evaluating the overall financial statement presentation.\nWe believe that our audits provide a reasonable basis for our opinion.\n\nIn our opinion, such consolidated financial statements present fairly, in all\nmaterial respects, the financial position of Movie Star, Inc. and subsidiaries\nas of June 30, 1999 and 1998, and the results of their operations and their cash\nflows for each of the three years in the period ended June 30, 1999 in\nconformity with generally accepted accounting principles. Also, in our opinion,\nsuch financial statement schedule, when considered in relation to the basic\nconsolidated financial statements taken as a whole, presents fairly in all\nmaterial respects the information set forth therein.\n\nDeloitte & Touche LLP\nSeptember 22, 1999\nNew York, New York\n\n                                     F-1\n\n<PAGE>\n\n\nMOVIE STAR, INC. AND SUBSIDIARIES\n\nCONSOLIDATED BALANCE SHEETS\nJUNE 30, 1999 AND 1998\n(In Thousands, Except Number of Shares)\n_______________________________________________________________________________\n\nASSETS                                                       1999     1998\n\nCURRENT ASSETS:\n  Cash                                                     $ 4,597   $   546\n  Receivables                                                6,864     6,330\n  Inventory                                                 16,460    20,945\n  Deferred income taxes                                      1,983     2,200\n  Prepaid expenses and other current assets                    602       456\n                                                          --------    ------\n            Total current assets                            30,506    30,477\n\nPROPERTY, PLANT AND EQUIPMENT - Net                          3,495     3,551\n\nOTHER ASSETS                                                   732       906\n\nDEFFERED INCOME TAXES                                        2,026     1,809\n                                                          --------    ------\n\nTOTAL ASSETS                                              $ 36,759  $ 36,743\n                                                          ========  ========\n\nLIABILITIES AND STOCKHOLDERS' EQUITY\n\nCURRENT LIABILITIES:\n   Notes payable                                          $    --   $   328\n   Current maturities of long-term debt\n     and capital lease obligations                             45        40\n   Accounts payable                                         4,529     7,234\n   Accrued expenses and other current\n     liabilities                                            3,316     2,959\n                                                          -------    ------\n            Total current liabilities                       7,890    10,561\n                                                          -------    ------\nLONG-TERM DEBT AND CAPITAL LEASE OBLIGATIONS               20,703    20,980\n                                                          -------    ------\nCOMMITMENTS AND CONTINGENCIES                                  --        --\n\nSTOCKHOLDERS' EQUITY\n   Common stock, $.01 par value - authorized,\n     30,000,000 shares; issued 16,897,000\n     shares in 1999 and 16,134,000 shares in 1998             169       161\n   Additional paid-in capital                               4,072     3,789\n   Retained earnings                                        7,543     4,870\n                                                          -------    ------\n\n                                                           11,784     8,820\n\n   Less treasury stock, at cost - 2,017,000 shares          3,618     3,618\n                                                          -------    ------\n           Total stockholders' equity                       8,166     5,202\n\nTOTAL LIABILITIES AND STOCKHOLDERS' EQUITY                $36,759   $36,743\n                                                          =======   =======\n\n\nSee notes to consolidated financial statements.\n\n                                      F-2\n\n\nMOVIE STAR, INC. AND SUBSIDIARIES\n\nCONSOLIDATED STATEMENTS OF INCOME\nYEARS ENDED JUNE 30, 1999, 1998 AND 1997\n(In Thousands, Except Per Share Amounts)\n_____________________________________________________________________________\n\n\n                                            1999          1998           1997\n\nNET SALES                                 $72,506       $64,537        $61,470\n\nCOST OF SALES                              51,363        45,777         44,947\n                                          -------       -------       --------\n\n    GROSS PROFIT                           21,143        18,760         16,523\n\nOPERATING EXPENSES:\n   Selling, general and\n     administrative expenses               15,859        15,206         13,875\n                                          -------       -------       --------\n\n    INCOME FROM OPERATIONS                  5,284         3,554          2,648\n\nGAIN ON PURCHASES OF SUBORDINATED\n   DEBENTURES AND SENIOR NOTES                  -          (157)          (560)\n\nINTEREST INCOME                              (118)         (130)          (157)\n\nINTEREST EXPENSE                            2,694         2,623          2,781\n                                          -------       -------       --------\n\n    INCOME BEFORE PROVISION FOR\n      INCOME TAXES                         2,708         1,218             584\n\nPROVISION FOR INCOME TAXES                    35            16              65\n                                          -------       -------       --------\n\n    NET INCOME                           $ 2,673       $ 1,202          $ 519\n                                         =======       =======          =====\n\nBASIC NET INCOME PER SHARE                  $.19          $.09           $.04\n                                            ====          ====           ====\n\nDILUTED NET INCOME PER SHARE                $.17          $.08           $.04\n                                            ====          ====           ====\n\nBASIC WEIGHTED AVERAGE NUMBER\n   OF SHARES OUTSTANDING                  14,309        14,049         13,960\n                                          ======        ======         ======\n\nDILUTED WEIGHTED AVERAGE NUMBER\n   OF SHARES OUTSTANDING                  15,869        15,161         15,868\n                                          ======        ======         ======\n\nSee notes to consolidated financial statements.\n\n                                      F-3\n\n\nMOVIE STAR, INC. AND SUBSIDIARIES\n\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY\nYEARS ENDED JUNE 30, 1999, 1998 AND 1997\n(In Thousands)\n_______________________________________________________________________________",
                        {
                            "type": "table",
                            "content": [
                                {
                                    "type": "caption",
                                    "content": [
                                        "\n                                                                   Additional\n                                            Common Stock           Paid-in        Retained          Treasury Stock\n                                        Shares       Amount        Capital        Earnings       Shares        Amount       Total\n\n<S>                                     <C>          <C>            <C>            <C>            <C>         <C>          <C>\nBALANCE, JUNE 30, 1996                  15,977       $ 160          $3,731         $3,149         2,017       $(3,618)     $3,422\n\n   Net income                                -           -               -            519             -             -         519\n                                        ------       -----          ------         ------         -----       -------      ------\n\nBALANCE, JUNE 30, 1997                  15,977         160           3,731         3,668          2,017        (3,618)      3,941\n\n   Net income                                -           -               -         1,202              -             -       1,202\n   Conversion of long-term debt\n     for common stock                      157           1              58             -              -             -          59\n                                        ------       -----          ------         ------         -----       -------      ------\n\nBALANCE, JUNE 30, 1998                  16,134         161           3,789         4,870          2,017        (3,618)      5,202\n\n   Net income                                -           -               -         2,673              -             -       2,673\n   Conversion of long-term debt\n     for common stock                      743           8             278             -              -             -         286\n   Exercise of stock options                20           -               5             -              -             -           5\n                                        ------       -----          ------         ------         -----       -------      ------\n\nBALANCE, JUNE 30, 1999                  16,897       $ 169          $4,072        $7,543          2,017      $(3,618)      $8,166\n                                        ======       =====          ======        ======          =====      =======       ======\n</TABLE>\n\nSee notes to consolidated financial statements.\n\n                                      F-4\n\nMOVIE STAR, INC. AND SUBSIDIARIES\n\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYEARS ENDED JUNE 30, 1999, 1998, AND 1997\n(In Thousands)\n_______________________________________________________________________________\n\n<TABLE>\n                                                                                        1999         1998          1997\n\n<S>                                                                                   <C>          <C>            <C>\nCASH FLOWS FROM OPERATING ACTIVITIES:\n   Net income                                                                         $ 2,673      $ 1,202        $ 519\n   Adjustments to reconcile net income to net cash\n    provided by (used in) operating activities\n     Depreciation and amortization                                                        566          582          698\n     Provision for sales allowances and doubtful accounts                                (191)          98       (1,378)\n     Gain on purchases of subordinated debentures and senior notes                          -         (157)        (560)\n     Loss on disposal of property, plant and equipment                                     16            4           35\n   (Increase) decrease in operating assets:\n     Receivables                                                                         (343)      (2,281)       4,646\n     Inventory                                                                          4,485       (4,307)      (2,391)\n     Prepaid expenses and other current assets                                           (146)        (251)         (97)\n     Other assets                                                                          32          (66)         215\n   Increase (decrease) in operating liabilities:\n     Accounts payable                                                                  (2,705)       2,247         (490)\n     Accrued expenses and other current liabilities                                       357          339          503\n                                                                                       ------        -----        -----\n\n           Net cash provided by (used in) operating activities                          4,744       (2,590)       1,700\n                                                                                       ------        -----        -----\n\nCASH FLOWS FROM INVESTING ACTIVITIES:\n   Purchases of property, plant and equipment                                            (528)        (191)        (133)\n   Proceeds from sale of property and equipment                                           200          500            -\n   Proceeds from sale of other assets (interest in building)                                -          619            -\n                                                                                       ------        -----        -----\n\n           Net cash (used in) provided by investing activities                           (328)         928         (133)\n                                                                                       ------        -----        -----\nCASH FLOWS FROM FINANCING ACTIVITIES:\n   Repayment on and purchases of long-term debt and\n    capital lease obligations                                                             (50)      (1,155)        (815)\n   Net (repayment) proceeds of revolving line of credit                                  (328)         328            -\n   Exercise of stock options                                                               13            -            -\n                                                                                       ------        -----        -----\n\n           Net cash used in financing activities                                         (365)        (827)        (815)\n                                                                                       ------        -----        -----\n\nNET INCREASE (DECREASE) IN CASH                                                         4,051       (2,489)         752\nCASH, BEGINNING OF YEAR                                                                   546        3,035        2,283\n                                                                                       ------        -----        -----\n\nCASH, END OF YEAR                                                                     $ 4,597       $  546      $ 3,035\n                                                                                      =======       ======      =======\n</TABLE>\n\n                                                                   (Continued)\n\n                                      F-5\n\n\n\nMOVIE STAR, INC. AND SUBSIDIARIES\n\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYEARS ENDED JUNE 30, 1999, 1998, AND 1997\n(In Thousands)\n_______________________________________________________________________________",
                                        {
                                            "type": "table",
                                            "content": [
                                                "\n                                                               1999          1998          1997\n<S>                                                           <C>           <C>           <C>\nSUPPLEMENTAL DISCLOSURES OF CASH FLOW\n   INFORMATION:\n   Cash paid during period for:\n     Interest                                                 $ 2,584       $2,544        $2,256\n                                                              =======       ======        ======\n     Income taxes (net of refunds received)                   $    25       $   13        $   16\n                                                              =======       ======        ======\n\nSUPPLEMENTAL DISCLOSURES OF NONCASH\n   INVESTING ACTIVITIES:\n  Acquisition of equipment through assumption of\n    capital lease obligation                                  $   56        $    -        $ 139\n                                                              ======        ======        =====\n\nSUPPLEMENTAL DISCLOSURES OF NONCASH\n  FINANCING ACTIVITIES:\n  Conversion of long-term debt for common stock               $(278)        $  (59)       $   -\n  Issuance of common stock                                      278             59            -\n                                                              -----         ------        -----\n                                                              $   -         $    -        $   -\n                                                              =====         ======        =====\n\nSUPPLEMENTAL DISCLOSURES OF NONCASH\n  ACTIVITIES:\n  Increase in long-term debt for interest paid\n    in kind                                                   $   -         $    -        $ 217\n  Decrease in accrued liabilities for interest\n    paid in kind                                                  -              -         (217)\n                                                              -----         ------        -----\n                                                              $   -         $    -        $   -\n                                                              =====         ======        ====="
                                            ]
                                        },
                                        "<S>                                                           <C>           <C>           <C>"
                                    ]
                                }
                            ]
                        },
                        "\nSee notes to consolidated financial statements.\n\n                                      F-4\n\nMOVIE STAR, INC. AND SUBSIDIARIES\n\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYEARS ENDED JUNE 30, 1999, 1998, AND 1997\n(In Thousands)\n_______________________________________________________________________________\n\n<TABLE>\n                                                                                        1999         1998          1997\n\n<S>                                                                                   <C>          <C>            <C>\nCASH FLOWS FROM OPERATING ACTIVITIES:\n   Net income                                                                         $ 2,673      $ 1,202        $ 519\n   Adjustments to reconcile net income to net cash\n    provided by (used in) operating activities\n     Depreciation and amortization                                                        566          582          698\n     Provision for sales allowances and doubtful accounts                                (191)          98       (1,378)\n     Gain on purchases of subordinated debentures and senior notes                          -         (157)        (560)\n     Loss on disposal of property, plant and equipment                                     16            4           35\n   (Increase) decrease in operating assets:\n     Receivables                                                                         (343)      (2,281)       4,646\n     Inventory                                                                          4,485       (4,307)      (2,391)\n     Prepaid expenses and other current assets                                           (146)        (251)         (97)\n     Other assets                                                                          32          (66)         215\n   Increase (decrease) in operating liabilities:\n     Accounts payable                                                                  (2,705)       2,247         (490)\n     Accrued expenses and other current liabilities                                       357          339          503\n                                                                                       ------        -----        -----\n\n           Net cash provided by (used in) operating activities                          4,744       (2,590)       1,700\n                                                                                       ------        -----        -----\n\nCASH FLOWS FROM INVESTING ACTIVITIES:\n   Purchases of property, plant and equipment                                            (528)        (191)        (133)\n   Proceeds from sale of property and equipment                                           200          500            -\n   Proceeds from sale of other assets (interest in building)                                -          619            -\n                                                                                       ------        -----        -----\n\n           Net cash (used in) provided by investing activities                           (328)         928         (133)\n                                                                                       ------        -----        -----\nCASH FLOWS FROM FINANCING ACTIVITIES:\n   Repayment on and purchases of long-term debt and\n    capital lease obligations                                                             (50)      (1,155)        (815)\n   Net (repayment) proceeds of revolving line of credit                                  (328)         328            -\n   Exercise of stock options                                                               13            -            -\n                                                                                       ------        -----        -----\n\n           Net cash used in financing activities                                         (365)        (827)        (815)\n                                                                                       ------        -----        -----\n\nNET INCREASE (DECREASE) IN CASH                                                         4,051       (2,489)         752\nCASH, BEGINNING OF YEAR                                                                   546        3,035        2,283\n                                                                                       ------        -----        -----\n\nCASH, END OF YEAR                                                                     $ 4,597       $  546      $ 3,035\n                                                                                      =======       ======      =======\n</TABLE>\n\n                                                                   (Continued)\n\n                                      F-5\n\n\n\nMOVIE STAR, INC. AND SUBSIDIARIES\n\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYEARS ENDED JUNE 30, 1999, 1998, AND 1997\n(In Thousands)\n_______________________________________________________________________________",
                        {
                            "type": "table",
                            "content": [
                                "\n                                                               1999          1998          1997\n<S>                                                           <C>           <C>           <C>\nSUPPLEMENTAL DISCLOSURES OF CASH FLOW\n   INFORMATION:\n   Cash paid during period for:\n     Interest                                                 $ 2,584       $2,544        $2,256\n                                                              =======       ======        ======\n     Income taxes (net of refunds received)                   $    25       $   13        $   16\n                                                              =======       ======        ======\n\nSUPPLEMENTAL DISCLOSURES OF NONCASH\n   INVESTING ACTIVITIES:\n  Acquisition of equipment through assumption of\n    capital lease obligation                                  $   56        $    -        $ 139\n                                                              ======        ======        =====\n\nSUPPLEMENTAL DISCLOSURES OF NONCASH\n  FINANCING ACTIVITIES:\n  Conversion of long-term debt for common stock               $(278)        $  (59)       $   -\n  Issuance of common stock                                      278             59            -\n                                                              -----         ------        -----\n                                                              $   -         $    -        $   -\n                                                              =====         ======        =====\n\nSUPPLEMENTAL DISCLOSURES OF NONCASH\n  ACTIVITIES:\n  Increase in long-term debt for interest paid\n    in kind                                                   $   -         $    -        $ 217\n  Decrease in accrued liabilities for interest\n    paid in kind                                                  -              -         (217)\n                                                              -----         ------        -----\n                                                              $   -         $    -        $   -\n                                                              =====         ======        ====="
                            ]
                        },
                        "\n\n                                                                     (Concluded)\n\nSee notes to consolidated financial statements.\n\n                                      F-6\n\nMOVIE STAR, INC. AND SUBSIDIARIES\n\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nYEARS ENDED JUNE 30, 1999, 1998 AND 1997\n_______________________________________________________________________________\n\n1.   SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\n\n     Business - Movie Star, Inc. and its subsidiaries (the \"Company\") is a New\n     York corporation organized in 1935, which designs, manufactures, markets\n     and sells an extensive line of ladies' sleepwear, robes, leisurewear,\n     loungewear, panties and daywear; and also operates 28 retail stores.\n\n     Principles of Consolidation - The consolidated financial statements include\n     the accounts of the Company. All significant intercompany accounts and\n     transactions have been eliminated.\n\n     Use of Estimates - The preparation of financial statements in conformity\n     with generally accepted accounting principles requires management to make\n     estimates and assumptions that affect the reported amounts of assets and\n     liabilities, and the reported amounts of revenues and expenses during the\n     reporting period. The preparation of financial statements in conformity\n     with generally accepted accounting principles also requires management to\n     make estimates and assumptions that affect the disclosures of contingent\n     assets and liabilities at the date of the financial statements. Actual\n     results could differ from those estimates.\n\n     Inventory - Inventory is valued at lower of cost (first-in, first-out) or\n     market.\n\n     Property, Plant and Equipment - Property, plant and equipment are stated at\n     cost. Depreciation and amortization are provided by the straight-line\n     method over the following estimated useful lives:\n\n        Buildings and improvements          15 - 30 years\n        Machinery & Equipment               5 years\n        Office furniture and equipment      5 years\n        Leasehold improvements              Lesser of life of the asset or life\n                                             of lease\n\n     Revenue Recognition - Revenue is recognized upon shipment. Although sales\n     are made without the right of return, in certain instances, the Company may\n     accept returns or agree to allowances. Allowances for sales returns are\n     recorded as a component of net sales in the period in which the related\n     sales are recognized.\n\n     Income Taxes - The Company follows Statement of Financial Accounting\n     Standards (\"SFAS\") No. 109, \"Accounting for Income Taxes.\"\n\n     Net Income Per Share - During the second quarter of fiscal 1998, the\n     Company adopted SFAS No. 128, \"Earnings Per Share,\" as required. The\n     Company has restated all previously recorded net income per share amounts\n     for all periods presented.\n\n     Deferred Costs - Deferred financing costs are amortized over the life of\n     the debt using the straight-line method.\n\n     Comprehensive Income - Effective July 1, 1998, the Company adopted the\n     provisions of SFAS No. 130, \"Reporting Comprehensive Income.\" This\n     Statement establishes standards for reporting of comprehensive income and\n     its components in the financial statements. For the years ended June 1999,\n     1998 and 1997, comprehensive income approximated net income.\n\n                                      F-7\n\n     Recently Issued Accounting Standard - In June 1998, the Financial\n     Accounting Standards Board issued SFAS No. 133, \"Accounting for Derivative\n     Instruments and Hedging Activities.\" This Statement establishes accounting\n     and reporting standards for derivative instruments and hedging activities.\n     It requires the recognition of all derivatives as either assets or\n     liabilities in the statement of financial position and measurement of those\n     instruments at fair value. The accounting for changes in the fair value of\n     a derivative is dependent upon the intended use of the derivative. SFAS No.\n     133 will be effective in the Company's first quarter of the fiscal year\n     ending June 30, 2001 and retroactive application is not permitted. The\n     Company has not yet determined whether the application of SFAS No. 133 will\n     have a material impact on its financial position or results of operations.\n\n     Reclassification - Certain items in prior years in specific captions of the\n     accompanying consolidated financial statements and notes to consolidated\n     financial statements have been reclassified for comparative purposes.\n\n\n2.   INVENTORY\n\n     Inventory consists of the following:\n\n\n                                                             June 30,\n                                                        1999          1998\n                                                          (In Thousands)\n\n         Raw materials                                $ 5,513       $ 8,762\n         Work-in process                                2,121         2,431\n         Finished goods                                 8,826         9,752\n                                                      -------       -------\n                                                      $16,460       $20,945\n                                                      =======       =======\n\n3.  RECEIVABLES\n\n    Receivables are comprised of the following:\n\n\n                                                             June 30,\n                                                        1999           1998\n                                                          (In Thousands)\n\n         Trade                                        $ 7,986        $ 7,666\n         Other                                             23              -\n                                                      -------        --------\n                                                        8,009          7,666\n         Less allowance for doubtful accounts          (1,145)        (1,336)\n                                                      -------        -------\n\n                                                      $ 6,864        $ 6,330\n                                                      =======        =======\n\n                                      F-8\n\n\n\n4.  PROPERTY, PLANT AND EQUIPMENT\n\n    Property, plant and equipment consists of the following:\n\n                                                             June 30,\n                                                        1999           1998\n                                                          (In Thousands)\n\n         Land, buildings and improvements             $ 6,023        $ 6,233\n         Machinery and equipment                          578            478\n         Office furniture and equipment                 1,229            907\n         Leasehold improvements                           203            187\n                                                       ------         ------\n                                                        8,033          7,805\n         Less accumulated depreciation and\n             amortization                              (4,538)        (4,254)\n                                                       ------         ------\n\n                                                      $ 3,495        $ 3,551\n                                                      =======        =======\n\n\n     The Company held for sale or lease certain property, plant and equipment\n     with a net book value of approximately $324,000 and $518,000 at June 30,\n     1999 and 1998, respectively.\n\n\n5.   ACCRUED EXPENSES AND OTHER CURRENT LIABILITIES\n\n     Accrued expenses and other current liabilities are comprised of the\n     following:\n\n\n                                                             June 30,\n                                                        1999           1998\n                                                          (In Thousands)\n\n         Interest                                      $  534        $  540\n         Insurance                                      1,030           910\n         Salary, commissions and employee\n          benefits                                      1,274           964\n         Other                                            478           545\n                                                       ------         -----\n                                                       $3,316        $2,959\n                                                       ======        ======\n\n6.   NOTES PAYABLE\n\n     The Company has a line of credit agreement with a financial institution\n     expiring on July 1, 2001. Under the agreement, the Company may borrow for\n     either revolving loans or letters of credit up to the lesser of $13,500,000\n     or the sum of 80 percent of the net amount of eligible receivables, 50\n     percent of the eligible inventory and 50 percent of the eligible letters of\n     credit. Pursuant to the terms of the agreement, the Company has pledged\n     substantially all of its assets, except the Company's domestic inventory\n     and real property. Interest on outstanding borrowings is payable at 2\n     percent above the prime rate through June 30, 1999 and at the prime rate\n     commencing July 1, 1999. The Company paid a facility fee of approximately\n     $61,000 in fiscal 1999.\n\n\n                                      F-9\n\n<PAGE>\n\n     Under the terms of the agreement, the Company is required to meet certain\n     financial covenants, of which the Company is in compliance at June 30,\n     1999. Furthermore, the Company is prohibited from paying dividends or\n     incurring additional indebtedness, as defined, outside the normal course of\n     business.\n\n     At June 30, 1999, the Company had no borrowings outstanding under this line\n     of credit and had approximately $4,930,000 of outstanding letters of\n     credit. Additionally, the Company had a cash balance of approximately\n     $4,179,000 deposited with the lender, which earned interest at 3 percent\n     less than the prime rate at June 30, 1999.\n\n     At June 30, 1998, the Company had borrowings of $328,000 outstanding under\n     this line of credit at an interest rate of 10.5 percent and also had\n     approximately $3,503,000 of outstanding letters of credit.\n\n\n7.   LONG-TERM DEBT\n\n     Long-term debt consists of the following:\n\n                                                              June 30,\n                                                        1999           1998\n                                                          (In Thousands)\n\n         12.875% Subordinated Debentures               $ 9,987        $ 9,987\n         8% Senior Notes                                10,550         10,550\n         8% Senior Convertible Notes                        78            356\n         Capital Lease Obligations                         133            127\n                                                       -------        -------\n                                                        20,748         21,020\n         Less current portion                               45             40\n                                                      --------        -------\n\n         Long-term debt                                $20,703        $20,980\n                                                      ========        =======\n\n\n     12.875% Subordinated Debentures - On October 10, 1986, the Company sold\n     $25,000,000 of 12.875% Subordinated Debentures due October 1, 2001 (the\n     \"Debentures\"). Interest payments on the outstanding Debentures are due\n     semi-annually on October 1 and April 1. The Debentures are redeemable, in\n     whole or in part, at the option of the Company, at any time, and are\n     subordinated to all senior debt (as defined). The Debentures contain\n     covenants with respect to limitations on dividends and stock purchases.\n\n     Annual sinking fund payments of $3,750,000 are required commencing October\n     1, 1996. However, required payments in any year may be reduced by\n     Debentures previously purchased by the Company. During fiscal 1996, the\n     Company purchased Debentures totaling $2,550,000. In fiscal 1997, the\n     Company purchased $1,320,000 of Debentures for approximately $824,000\n     including related costs and recorded a pre-tax gain of $560,000.\n     Furthermore in fiscal 1997, the Company acquired $10,187,000 of 12.875%\n     Debentures in an exchange (discussed below). In October 1997, February 1998\n     and March 1998, the Company purchased $500,000, $156,000 and $300,000 in\n     principal amount of its 12.875% subordinated debentures, respectively. As a\n     result of these transactions, the Company recorded a pre-tax gain of\n     $153,000, net of related costs, in fiscal 1998. The Company satisfied the\n     October 1, 1996 and 1997 sinking fund requirements and intends to satisfy\n     its sinking fund requirements through 1999 and reduce part of the 2000\n     requirement with these purchased Debentures.\n\n\n                                      F-10\n\n<PAGE>\n\n     8% Senior Notes - In April 1996, the Company reached an agreement with\n     holders of $10,187,000 of the Company's outstanding 12.875% Debentures. The\n     holders of these Debentures agreed to exchange such Debentures for the\n     equivalent principal amount of a new series of notes (\"Senior Notes\")\n     bearing interest at a rate of 8 percent per annum, payable semi-annually\n     (April 1 and October 1) which will be senior to the remaining outstanding\n     Debentures. Additionally, these Debenture holders agreed to defer the\n     receipt of interest due April 1, 1996 (approximately $656,000) and October\n     1, 1996 (approximately $434,000) and to accept Senior Notes in exchange for\n     such deferred interest. The Senior Notes carried the right to convert up to\n     $715,500 of the Notes into 1,908,000 shares of the Company's common stock.\n     The Senior Notes will mature on September 1, 2001. As of June 30, 1999,\n     $78,000 of the 8% Convertible Senior Notes remain outstanding and are\n     convertible into 208,000 shares of the Company's common stock.\n\n     The debt exchange closed on October 15, 1996, but became effective\n     retroactively to April 1, 1996, the date of the deferral of interest on the\n     12.875% Debentures. In connection with the debt exchange, the Company\n     incurred certain costs, which have been capitalized and will be amortized\n     over the life of the Senior Notes using the straight-line method. The\n     Senior Notes contain covenants with respect to limitations on dividends and\n     stock purchases.\n\n     In November 1997, the Company purchased $300,000 in principal amount of its\n     8% Convertible Senior Notes due September 1, 2001. These Notes entitled the\n     previous holders to convert the principal amount into 800,000 shares of the\n     Company's common stock. In fiscal 1998, certain individuals affiliated with\n     the Company purchased $278,500 in principal amount of the 8% Convertible\n     Senior Notes due September 1, 2001. The purchasing affiliates converted the\n     Notes on March 31, 1999 into approximately 743,000 shares of the Company's\n     common stock, par value $.01. The affiliates have agreed to certain\n     restrictions on the circumstances under which they will be permitted to\n     sell the shares underlying the Notes. The affiliated purchasers have also\n     granted the Company the option to purchase the underlying shares at a price\n     equal to 90 percent of the market price at the time any purchaser is\n     permitted under the agreement to sell the underlying shares in the open\n     market and wishes to do so.\n\n     In December 1997, non-affiliated holders of $59,000 in principal amount of\n     the 8% Convertible Senior Notes converted their Notes into approximately\n     157,000 shares of the Company's common stock.\n\n     The maturities of long-term debt at June 30, 1999, including current\n     maturities, are as follows (in thousands):\n\n                            Fiscal Year             Amount\n\n                              2000                  $    45\n                              2001                    3,787\n                              2002 (9/1/01)          10,628\n                              2002 (10/1/01)          6,288\n                                                    -------\n\n                                                    $20,748\n                                                    =======\n\n\n                                      F-11\n\n<PAGE>\n\n8.  FAIR VALUE OF FINANCIAL INSTRUMENTS\n\n     The following disclosure of the estimated fair value of financial\n     instruments is made in accordance with the requirements of Statement of\n     Financial Accounting Standards No. 107, \"Disclosures About Fair Value of\n     Financial Instruments.\" The estimated fair value amounts have been\n     determined by the Company, using available market information and\n     appropriate valuation methodologies. However, considerable judgment is\n     required in interpreting market data to develop the estimates of fair\n     value. Accordingly, the estimates presented herein are not necessarily\n     indicative of the amounts that the Company could realize in a current\n     market exchange. The use of different market assumptions and/or estimation\n     methodologies may have a material effect on the estimated fair value\n     amounts.\n\n                                                       June 30,\n                                     -------------------------------------------\n                                             1999                   1998\n                                     --------------------    -------------------\n                                     Carrying Estimated   Carrying  Estimated\n                                      Amount  Fair Value   Amount   Fair Value\n                                                    (In Thousands)\n\n     Long-Term Debt and Capital\n      Lease Obligations             $20,748   $18,917     $21,020    $17,389\n\n\n     Cash, Accounts Receivable, Accounts Payable, Accrued Expenses and Other\n     Current Liabilities - The carrying value of these items approximates fair\n     value, based on the short-term maturities of these instruments.\n\n\n     Long-Term Debt and Capital Lease Obligations- The fair value of these\n     securities are estimated based on quoted market prices. If no market quotes\n     are available, interest rates that are currently available to the Company\n     for issuance of the debt with similar terms and remaining maturities are\n     used to estimate fair value of debt issues.\n\n\n     The fair value estimates presented herein are based on pertinent\n     information available to management as of June 30, 1999 and 1998. Although\n     management is not aware of any factors that would significantly affect the\n     estimated fair value amounts, such amounts have not been comprehensively\n     revalued for purposes of these financial statements since those respective\n     dates, and current estimates of fair value may differ significantly from\n     the amounts presented herein. Accordingly, the estimates presented herein\n     are not necessarily indicative of the amounts the Company could realize in\n     a current market exchange.\n\n\n9.   INCOME TAXES\n\n     Deferred income taxes reflect the net tax effects of (a) temporary\n     differences between the carrying amounts of assets and liabilities for\n     financial reporting purposes and the amounts used for income tax purposes,\n     and (b) operating losses. The income tax effects of significant items,\n     comprising the Company's net deferred tax assets and liabilities, are as\n     follows:\n\n                                      F-12\n\n\n\n                                                                 June 30,\n                                                             1999          1998\n                                                              (In Thousands)\n\n Deferred tax liabilities:\n  Differences between book and tax basis of property,\n   plant and equipment                                       $ 345        $ 529\n                                                             -----        -----\n\n Deferred tax assets:\n  Difference between book and tax basis of inventory           360          293\n  Reserves not currently deductible                          1,521        1,812\n  Operating loss carryforwards                               4,047        4,571\n  Difference between book and tax basis of senior notes      1,111        1,556\n  Other                                                         93           81\n                                                             -----        ------\n                                                             7,132        8,313\n                                                             -----        ------\n  Valuation allowance                                        2,778        3,775\n                                                             -----        ------\n Net deferred tax asset                                     $4,009       $4,009\n                                                            ======       ======\n\n  The provision for income taxes is comprised as follows:\n\n\n                                                      Year Ended June 30,\n                                                 1999          1998        1997\n                                                        (In Thousands)\n\n Current:\n  Federal                                        $25         $(2)          $65\n  State and local                                 10          18             -\n  Deferred                                         -           -             -\n                                                 ---         ---           ---\n                                                 $35         $16           $65\n                                                 ===         ===           ===\n\n  Reconciliation of the U.S. statutory rate with the Company's effective tax\n  rate is summarized as follows:\n\n                                                      Year Ended June 30,\n                                                 1999          1998        1997\n                                                        (In Thousands)\n\n\n Federal statutory rate                          34.0%         34.0%       34.0%\n\n Increase (decrease) in tax resulting from:\n  Valuation allowance                           (42.2)        (42.1)      (41.5)\n  State income taxes (net of federal tax\n    benefits)                                     6.6           6.0         6.0\n  Other                                           2.9           1.4         1.5\n  Alternative minimum tax                           -           2.0        11.1\n                                                 ----          ----        ----\n  Effective rate                                  1.3%          1.3%       11.1%\n                                                 ====          ====        ====\n\n\n                                      F-13\n\n<PAGE>\n\n     As of June 30, 1999, the Company has net operating loss carryforwards of\n     approximately $10,118,000 for income tax purposes that expire between the\n     years 2009 and 2012.\n\n10.  LEASES\n\n     The Company has operating leases expiring in various years through fiscal\n     2002, which include, in addition to fixed rentals, escalation clauses that\n     require the Company to pay a percentage of increases in occupancy expenses.\n\n     Future minimum payments under these leases at June 30, 1999 are as follows\n     (in thousands):\n\n                          Fiscal Year              Amount\n\n                            2000                  $  634\n                            2001                     504\n                            2002                       6\n                                                  ------\n\n                                                  $1,144\n                                                  ======\n\n     Rental expense for 1999, 1998 and 1997 was approximately $771,000, $764,000\n     and $787,000, respectively.\n\n\n11.  CONSULTING AGREEMENT\n\n     Commencing July 1, 1999, the Company entered into a five-year consulting\n     agreement with a majority shareholder, pursuant to which annual\n     compensation payments of approximately $200,000 are required.\n\n\n12.  CONCENTRATION OF CREDIT RISK AND MAJOR CUSTOMERS\n\n     Financial instruments which potentially expose the Company to\n     concentrations of credit risk consist primarily of trade accounts\n     receivable. The Company's customers are not concentrated in any specific\n     geographic region but are concentrated in the retail industry. One customer\n     accounted for 22, 20, and 17 percent of the Company's net sales in fiscal\n     1999, 1998 and 1997, respectively. Another customer accounted for 14, 11,\n     and 12 percent of the Company's net sales in fiscal 1999, 1998 and 1997,\n     respectively. Additionally, another customer accounted for 11 and 3 percent\n     of the Company's net sales in fiscal 1999 and 1998, respectively, and less\n     than 1 percent in 1997 while another customer accounted for 5, 8, and 11\n     percent of the Company's net sales in fiscal 1999, 1998 and 1997,\n     respectively. The Company performs ongoing credit evaluations of its\n     customers' financial condition. The Company establishes an allowance for\n     doubtful accounts based upon factors surrounding the credit risk of\n     specific customers, historical trends and other information.\n\n\n13.  STOCK PLANS, OPTIONS AND WARRANT\n\n     Employee Stock Ownership Plan - The Company has an Employee Stock Ownership\n     and Capital Accumulation Plan and Trust covering substantially all of its\n     employees, pursuant to which it can elect to make contributions to the\n     Trust in such amounts as may be determined by the Board of Directors. No\n     contributions were made for the years ended June 30, 1999, 1998 and 1997.\n\n                                      F-14\n\n     Stock Options - The Company has an Incentive Stock Option Plan (\"1983\n     ISOP\"), pursuant to which the Company has reserved 5,000 shares at June 30,\n     1999. This plan expired by its terms on June 30, 1993, but 5,000 previous\n     grants remained outstanding at June 30, 1999, of which 4,400 are presently\n     exercisable. The 1983 ISOP provided for the issuance of options to\n     employees to purchase common stock of the Company at a price not less than\n     fair market value on the date of grant.\n\n     On December 8, 1994, the Company's stockholders' approved a new Incentive\n     Stock Option Plan (\"1994 ISOP\") to replace the 1983 ISOP discussed above.\n     Options granted, pursuant to the plan, are not subject to a uniform vesting\n     schedule. The plan permits the issuance of options to employees to purchase\n     common stock of the Company at a price not less than fair market value on\n     the date of the option grant. The plan reserves 2,000,000 shares of common\n     stock for grant and provides that the term of each award be determined by\n     the Compensation Committee with all awards made within the ten-year period\n     following the effective date.\n\n     The Company also has a Key Employee Stock Option Plan covering the issuance\n     of up to 1,667,000 shares of the Company's common stock. Options to\n     purchase 200,000 shares at an exercise price of $.625 per share are\n     outstanding at June 30, 1999. None of the options granted are presently\n     exercisable.\n\n     Statement of Financial Accounting Standards No. 123, \"Accounting\n     Stock-Based Compensation\" was effective for the Company for fiscal 1997.\n     SFAS No. 123 encourages (but does not require) compensation expense to be\n     measured based on the fair value of the equity instrument awarded. In\n     accordance with APB No. 25, no compensation cost has been recognized in the\n     Consolidated Statements of Income for the Company's stock option plans. If\n     compensation cost for the Company's stock option plans had been determined\n     in accordance with the fair value method prescribed by SFAS No. 123, the\n     Company's net income would have been $2,333,000, $858,000 and $183,000 for\n     1999, 1998 and 1997, respectively. Basic net income per share would have\n     been $.16, $.06, and $.02 for 1999, 1998 and 1997, respectively and diluted\n     net income per share would have been $.15, $.06 and $.01 for 1999, 1998 and\n     1997, respectively. This pro forma information may not be representative of\n     the amounts to be expected in future years as the fair value method of\n     accounting prescribed by SFAS No. 123 has not been applied to options\n     granted prior to 1995.\n\n     Information with respect to stock options is as follows (shares in\n     thousands):",
                        {
                            "type": "table",
                            "content": [
                                {
                                    "type": "caption",
                                    "content": [
                                        "\n                                                              1999                        1998                    1997\n                                                      ----------------------    ----------------------    -----------------------\n                                                                  Weighted-                  Weighted-                  Weighted-\n                                                                   Average                    Average                    Average\n                                                                   Exercise                  Exercise                   Exercise\n                  FIXED OPTIONS                      Shares         Price        Shares        Price        Shares        Price\n<S>                                                     <C>          <C>           <C>         <C>            <C>         <C>"
                                    ]
                                },
                                "         Outstanding - beginning of year                2,253        $ .75         2,053       $ .76          1,701       $1.43\n         Granted                                          435          .63           200         .72          1,845         .63\n         Exercised                                        (20)        (.63)            -           -              -           -\n         Canceled                                        (593)       (1.05)            -           -         (1,493)       1.36\n                                                    ----------  -----------     --------   ---------         -------    -------\n         Outstanding - end of year                      2,075        $ .64        2,253        $ .75          2,053       $ .76\n                                                    ==========       =====      =======        =====         ======       =====\n\n         Exercisable - end of year                        780        $ .67          996        $ .88            708       $ .94\n                                                    ==========       =====      =======        =====         ======       =====\n         Weighted-average fair value of\n           options granted during the year                           $ .69                     $ .64                      $ .58\n                                                                     ======                    =====                      ====="
                            ]
                        },
                        "\n     The fair value of each option-pricing model with the following\n     weighted-average assumptions used for grants in 1999 and 1998,\n     respectively; risk-free interest rate 5.5 % and 5.7%; expected life 7 years\n     and 7 years; expected volatility of 95.3% and 115.9%. The fair values\n     generated by the Black-Scholes model may not be indicative of the future\n     benefit, if any, that may be received by the option holder.\n\n                                      F-15\n\n\n\n     The following table summarizes information about stock options outstanding\n     at June 30, 1999 (options in thousands):\n\n<TABLE>\n                             Options Outstanding                                                  Options Exercisable\n    --------------------------------------------------------------------------------      ------------------------------------\n                          Weighted-Average\n                               Number              Remaining            Weighted-                                 Weighted-\n        Range of           Outstanding at         Contractual            Average          Exercisable at           Average\n    Exercise Prices        June 30, 1999            Life (Yrs)       Exercise Price       June 30, 1999        Exercise Price\n    ---------------     ------------------        -------------      --------------       ---------------      --------------\n<S>  <C>                        <C>                   <C>                 <C>                   <C>                 <C>\n     $.625 - $1.375             2,075                 7.9                 $.64                  780                 $.67\n</TABLE>\n\n\n     Warrant - In October 1998, in connection with an agreement with a financial\n     consulting firm, the Company granted a warrant to purchase 50,000 shares of\n     its common stock at $.4375 per share to the consultants. The warrant is\n     exercisable at anytime within ninety days following written notice from the\n     Company of the Company's intention to file a Registration Statement other\n     than on Form S-4 and S-8, under the Securities Act of 1933, as amended. No\n     expense related to such warrant was recorded since it was not material.\n\n14.  Net Income Per Share\n\n     The Company's calculation of Basic and Diluted Net Income Per Share are as\n     follows (in thousands, except per share amounts):\n\n                                                    Year Ended June 30,\n                                               1999         1998         1997\n     Basic Net Income Per Share               (In Thousands, Except Per Share)\n\n     Net Income to Common Stockholders       $ 2,673      $ 1,202       $  519\n                                             =======      =======       ======\n     Basic Weighted Average Shares\n       Outstanding                            14,309       14,049       13,960\n                                             =======      =======       ======\n     Basic Net Income Per  Share                $.19         $.09         $.04\n                                                ====         ====         ====\n\n     Diluted Net Income Per Share:\n\n     Net Income to Common Stockholders       $ 2,673      $ 1,202       $  519\n     Plus: Interest Expense on 8%\n      Convertible Senior Notes                     6           40           57\n                                             -------      -------       ------\n     Adjusted Net Income                    $  2,679      $ 1,242       $  576\n                                            ========      =======       ======\n\n     Weighted Average Shares Outstanding      14,309       14,049       13,960\n     Plus: Shares Issuable Upon Conversion\n           of 8% Convertible Senior Notes        765        1,112        1,908\n          Shares Issuable Upon Conversion\n           of Stock Options                      771            -             -\n          Shares Issuable Upon Conversion\n           of Warrants                            24            -             -\n                                              ------      -------       -------\n    Diluted Weighted Average Shares\n      Outstanding                             15,869       15,161       15,868\n                                             =======      =======       ======\n    Diluted Net Income  Per Share               $.17         $.08         $.04\n                                                ====         ====         ====\n\n                                      F-16\n\n<PAGE>\n\n15.  SEGMENT-RELATED INFORMATION\n\n     The Company has implemented SFAS No. 131 \"Disclosures About Segments of an\n     Enterprise and Related Information.\" This Statement requires the Company to\n     use a management approach in identifying segments of its business. Prior\n     year's comparative financial information has been restated to conform with\n     the current year's presentation of segment-related information.\n\n     The Company has two reportable business segments: intimate apparel and\n     retail. The Company's reportable segments are individual business units\n     that offer different products and services. They are managed separately\n     because each segment requires different strategic initiatives, marketing,\n     and advertising based on its own individual positioning in the market.\n     Additionally, these segments reflect the reporting basis used internally by\n     senior management to evaluate performance and the allocation of resources.\n\n     The Company's intimate apparel segment designs, sources, manufactures,\n     markets and sells an extensive line of ladies' intimate apparel. This\n     segment primarily sells to discount, specialty, national and regional\n     chain, mass merchandise and department stores and direct mail catalog\n     marketers throughout the United States, as well as its Company-owned retail\n     stores.\n\n     The retail segment sells apparel products purchased primarily from external\n     suppliers, as well as from the Company's intimate apparel segment.\n\n     The accounting policies of the segments are consistent with those described\n     in Note 1, Significant Accounting Policies. Intersegment sales and\n     transfers are recorded at cost and treated as a transfer of inventory.\n     Senior management does not review these sales when evaluating segment\n     performance. The Company's senior management evaluates each segment's\n     performance based upon income or loss from operations before interest,\n     nonrecurring gains and losses and income taxes.\n\n     The Company's net sales, income from operations, depreciation and\n     amortization, total assets and capital expenditures for each segment for\n     the years ended June 30, 1999, 1998 and 1997 were as follows:\n\n                                                   Year Ended June 30,\n                                              1999          1998         1997\n                                                      (In Thousands)\n\n     Net Sales:\n      Intimate Apparel (a)                  $63,006        $53,855    $51,241\n      Retail                                  9,500         10,682     10,229\n                                            -------        -------    -------\n                                            $72,506        $64,537    $61,470\n                                            =======        =======     ======\n    Income From Operations:\n      Intimate Apparel (a)                  $ 4,564        $ 2,316     $1,542\n      Retail                                    720          1,238      1,106\n                                            -------        -------     ------\n                                            $ 5,824        $ 3,554     $2,468\n                                            =======        =======     ======\n   Depreciation and Amortization:\n     Intimate Apparel (a)                   $   526        $   549     $  664\n     Retail                                      40             33         34\n                                            -------        -------     ------\n                                            $   566        $   582     $  698\n                                            =======        =======     ======\n\n                                      F-17\n\n\n\n                                                   Year Ended June 30,\n                                              1999          1998         1997\n                                                      (In Thousands)\n\n    Segment Assets:\n       Intimate Apparel (a)                 $33,547        $33,147    $30,858\n       Retail                                 3,212          3,596      3,099\n                                            -------        -------    -------\n                                            $36,759        $36,743    $33,957\n                                            =======        =======    =======\n    Capital Expenditures:\n       Intimate Apparel (a)                 $   379        $   186    $   238\n                Retail                          205              5         34\n                                            -------        -------     ------\n                                            $   584        $   191    $   272\n                                            =======        =======    =======\n\n  (a) Includes discontinued apparel segment of men's, women's and children's\n      screen printed tee shirts in 1998 and 1997 of less than 10%.\n\n\n16.  SUBSEQUENT EVENT\n\n     During August and September 1999, the Company purchased $2,721,000 in\n     principal amount of its 12.875% subordinated debentures. As a result of the\n     transaction, the Company will record a pre-tax gain of approximately\n     $105,000, net of related costs, in the first quarter of fiscal 2000. The\n     Company will reduce its mandatory sinking fund requirement with these\n     debentures.\n\n\n17.  UNAUDITED SELECTED QUARTERLY FINANCIAL DATA\n\n                                                         Quarter\n                                           First    Second     Third     Fourth\n                                             (In Thousands, Except Per Share)\n\n    Fiscal Year Ended June 30, 1999\n\n      Net sales                           $18,958   $25,789   $14,715   $13,044\n      Gross profit                          5,657     7,386     4,381     3,719\n      Net income (loss)                     1,183     2,330       202    (1,042)\n      Basic net income (loss) per\n        share                                 .08       .17       .01      (.07)\n      Dilutive net income (loss) per\n        share                                 .08       .15       .01      (.07)\n\n\n                                      F-18\n\n<PAGE>\n\n                                                         Quarter\n                                           First    Second     Third     Fourth\n                                             (In Thousands, Except Per Share)\n\n    Fiscal Year Ended June 30, 1998\n\n      Net sales                           $15,202  $22,737    $12,918  $13,680\n      Gross profit                          4,284    6,489      3,784    4,203\n      Net income (loss)                       165    1,660       (123)    (500)\n      Basic net income (loss) per\n        share                                 .01      .12       (.01)    (.03)\n      Dilutive net income (loss) per\n        share                                 .01      .11       (.01)    (.03)\n\n\n                                                         Quarter\n                                           First    Second     Third     Fourth\n                                             (In Thousands, Except Per Share)\n\n    Fiscal Year Ended June 30, 1997\n\n      Net sales                         $12,894   $22,133    $13,089   $13,354\n      Gross profit                        3,285     5,745      3,535     3,958\n      Net income (loss)                     (63)    1,280       (329)     (369)\n      Basic net income (loss) per\n        share                                 -       .09       (.02)     (.03)\n      Dilutive net income (loss) per\n        share                                 -       .08       (.02)     (.03)\n\n\n                                   * * * * * *\n\n\n                                      F-19\n\n<PAGE>\n\n                                                                   Schedule II\nMOVIE STAR,  INC. AND SUBSIDIARIES\n\nVALUATION AND QUALIFYING ACCOUNTS\n(In Thousands)\n\n\n                      Column A       Column B    Column C   Column D    Column E\n\n                                                 Additions               Balance\n                                     Balance at  Charged to                at\n                                     Beginning   Costs and               End of\n                     Description     of Period   Expenses   Deductions   Period\n\nFISCAL YEAR ENDED JUNE 30, 1999:\n\nAllowance for doubtful accounts        $1,076     $   40    $ (40)(a)   $ 885\n                                                             (191)(b)\n\nAllowance for sales allowances            260      1,720   (1,720)        260\n                                       ------     ------   ------        ----\n\n                                       $1,336     $1,760  $(1,951)     $1,145\n                                       ======     ======  =======      ======\n\n\nFISCAL YEAR ENDED JUNE 30, 1998:\n\nAllowance for doubtful accounts       $  778      $  305  $    (7)(a)  $1,076\n\nAllowance for sales allowances           460       1,562   (1,762)        260\n                                       ------     ------   ------        ----\n\n                                      $1,238      $1,867  $(1,769)     $1,336\n                                       ======     ======  =======      ======\n\n\nFISCAL YEAR ENDED JUNE 30, 1997:\n\nAllowance for doubtful accounts       $1,956      $  192  $(1,370)(a)  $  778\n\nAllowance for sales allowances           660       1,315   (1,515)        460\n                                       ------     ------   ------        ----\n\n                                      $2,616      $1,507  $(2,885)     $1,238\n                                       ======     ======  =======      ======\n\n\n(a)      Uncollectible accounts written off.\n(b)      Reduction in allowance.\n\n\n                                      S-1\n\n"
                    ]
                },
                {
                    "type": "item",
                    "text": "item9",
                    "content": [
                        "\nNone\n\n\n                                     II-14\n\n<PAGE>"
                    ]
                }
            ]
        },
        {
            "type": "part",
            "text": "partiii",
            "content": [
                {
                    "type": "item",
                    "text": "item10",
                    "content": [
                        "\n\nDirector Since      Name              Age     Position\n--------------      ----              ---     --------\n1981                Mark M. David     52      Chairman of the Board\n\n\n1997                Melvyn Knigin     56      President, Chief Executive Officer\n                                              and Director\n\n1983                Saul Pomerantz    50      Executive Vice President, Chief\n                                              Operating Officer, Secretary\n                                              and Director\n\n1996                Gary W. Krat      51      Director\n1996                Joel M. Simon     54      Director\n\nOfficer Since\n-------------\n1999                Thomas Rende      38      Chief Financial Officer\n\n\nMark M. David was re-elected Chairman of the Board and Chief Executive Officer\non December 11, 1998. Effective as of July 1, 1999 Mr. David retired as a\nfull-time executive employee of the Company. Mr. David relinquished the position\nof Chief Executive Officer in February 1999, but remained as Chairman of the\nBoard. He had been Chairman of the Board and Chief Executive Officer from\nDecember 1985 to August 1995 and from April 1996 until February 1999, President\nfrom April 1983 to December 1987 and Chief Operating Officer of the Company\nsince the merger with Stardust Inc. in 1981 until December 1987. Prior to the\nmerger, he was founder, Executive Vice President and Chief Operating Officer of\nSanmark Industries Inc.\n\nMelvyn Knigin was elected to the Board of Directors on December 11, 1998. Mr.\nKnigin was appointed Chief Executive Officer in February 1999. Mr. Knigin was\nappointed to fill a vacancy on the Board of Directors and promoted to Senior\nVice President and Chief Operating Officer on February 5, 1997 and was promoted\nto President on September 4, 1997. Since joining the Company in 1987, he was the\nPresident of Cinema Etoile, the Company's upscale intimate apparel division.\nPrior to joining the Company, he had spent most of his career in the intimate\napparel industry.\n\nSaul Pomerantz, CPA, was re-elected to Board of Directors on December 11, 1998.\nMr. Pomerantz was appointed Chief Operating Officer in February 1999. Mr.\nPomerantz was elected Senior Vice President on December 3, 1987 and was promoted\nto Executive Vice President on September 4, 1997. Previously, he was Vice\nPresident-Finance since 1981. He was Chief Financial Officer from 1982 to\nFebruary 1999 and has been Secretary of the Company since 1983.\n\nThomas Rende was appointed Chief Financial officer in February 1999. Since\njoining Movie Star in 1989, Mr. Rende has held various positions within the\nfinance department.\n\nGary W. Krat was re-elected to the Board of Directors on December 11, 1998. Mr.\nKrat has been Senior Vice President of SunAmerica Inc. since 1990. He is also\nChairman and Chief Executive Officer of SunAmerica Financial Network, Inc. and\nits six NASD broker dealer companies with nearly ten thousand registered\nrepresentatives. From 1977 until 1990, Mr. Krat was a senior executive with\n\n\n                                     III-1\n\n<PAGE>\n\n\nIntegrated Resources, Inc. Prior to joining Integrated Resources, Mr. Krat was a\npracticing attorney. He has a law degree from Fordham University and a Bachelor\nof Arts degree from the University of Pittsburgh.\n\nJoel M. Simon was re-elected to the Board of Directors on December 11, 1998. Mr.\nSimon was the President and Chief Executive Officer of Starrett Corporation, a\nreal estate construction, development and management company from March to\nDecember 1998. Since then and from 1996 to 1998, Mr. Simon has been\nself-employed as a private investor. From 1990 until the end of 1996, Mr. Simon\nwas the Executive Vice President and Chief Operating Officer and, (until July\n1993), was a director of a group of affiliated companies known as Olympia & York\nCompanies (USA)(\"O&Y-USA\"), subsidiaries of a Canadian multinational real estate\nconcern. Prior to becoming Chief Operating Officer of O&Y-USA, from 1985 until\nthe end of 1989, Mr. Simon was the Executive Vice President-Administration and a\ndirector of O&Y-USA. Mr. Simon is a Certified Public Accountant and was a senior\npartner in an accounting firm prior to joining O&Y-USA. In 1992, O&Y- USA\nexperienced a liquidity crisis. The O&Y-USA crisis was caused and exacerbated by\nits inability to obtain financial support from its Canadian parent, as it had in\nthe past, because of the parent company's own financial crises. Since then, most\nof the O&Y-USA companies filed voluntary petitions for protection under Chapter\n11 of the U.S. Bankruptcy Code. Substantially all of these companies have had\ntheir plans of reorganization confirmed and consummated."
                    ]
                },
                {
                    "type": "item",
                    "text": "item11",
                    "content": [
                        "\nReport of the Compensation Committee on Executive Compensation\n\nJoel M. Simon, Gary W. Krat and Mark M. David were appointed by the Board of\nDirectors, and each of them agreed to serve as members of the Compensation\nCommittee (the \"Committee\").\n\nMark M. David relinquished the position of Chief Executive Officer in February\n1999 and as a result, the Company's President, Melvyn Knigin, was appointed to\nthe additional position of Chief Executive Officer, the Company's Executive Vice\nPresident, Saul Pomerantz, was assigned the additional duties of Chief Operating\nOfficer and Thomas Rende was promoted to the position of Chief Financial\nOfficer. Also, effective June 30, 1999, Mr. David retired as a full-time\nexecutive employee of the Company. Pursuant to a retirement program negotiated\nwith Mr. David, he received a lump sum retirement payment and entered into a\nwritten agreement with the Company to provide consulting services for a term of\nfive years for which he will receive a fixed annual fee. Pursuant to the terms\nof the agreements with Mr. David, he will remain as the non-executive Chairman\nof the Board of Directors and he is prohibited from participating in any\nbusiness which competes with the business of the Company. The salaries of\nMessrs. Knigin, Pomerantz and Rende were increased for fiscal year 1999. In\nlight of Mr. David's retirement and the new duties assumed by the Company's\nremaining senior executives, the Compensation Committee is in the process of\ndetermining whether to make any adjustments to the salaries of Messrs. Knigin,\nPomerantz and Rende for fiscal year 2000.\n\nCompensation Policies\n\nIn determining the appropriate levels of executive compensation for fiscal year\n1999, the Committee based its decisions on (1) the Company's continued improved\nfinancial condition, (2) the need to retain experienced individuals with proven\nleadership and managerial skills, (3) the executives' motivation to enhance the\nCompany's performance for the benefit of its shareholders and customers and (4)\nthe executives' contributions to the accomplishment of the Company's annual and\nlong-term business objectives.\n\nSalaries generally are determined based on the Committee's evaluation of the\nvalue of each executive's contribution to the Company, results of the past\nfiscal year in light of prevailing business conditions, the Company's goals for\nthe ensuing fiscal year and, to a lesser extent, prevailing levels at companies\nconsidered to be comparable to and competitors of the Company.\n\nIn addition to base salary compensation, the Committee has also, from time to\ntime, recommended that stock options be granted to the executive officers of the\nCompany in order to reward the officers' commitment to maximizing shareholder\nreturn and long-term results.\n\n                                      III-2\n\n\n\nBase Salary Compensation\n\nBased on recommendations from the Company's Chairman of the Board and the other\nCommittee members' collective business experience, base salaries are determined\nfrom year to year. The Committee does not utilize outside consultants to obtain\ncomparative salary information, but believes that the salaries paid by the\nCompany are competitive, by industry standards, with those paid by companies\nwith similar sales volume to the Company. The Committee places considerably more\nweight on each executive's contribution to the Company's development and\nmaintenance of its sources of supply, manufacturing capabilities, marketing\nstrategies and customer relationships than on the compensation policies of the\nCompany's competitors; however, the Committee does not establish or rely on\ntarget levels of performance in any of these areas to arrive at its\nrecommendations. Mr. David did not make recommendations with respect to his own\nsalary and does not participate in the Committee's determination of the salary\nand other compensation to be paid to the Company's senior executives.\n\nThe current senior executives of the Company have been associated with the\nCompany in senior management positions for periods ranging from ten to twenty\nyears. They have been primarily responsible for the formulation and\nimplementation of the Company's recent financial and operational restructuring\nand provide the Company with a broad range of management skills which are\nconsidered by the Committee to be an essential source of stability and a base\nfor the Company's future growth.\n\nStock Option Grants\n\nIn 1983, the Company adopted an Incentive Stock Option Plan (the \"ISOP\") to\nprovide a vehicle to supplement the base salary compensation paid to key\nemployees. All of the Company's senior executives were eligible to receive\ngrants under the ISOP. Options under the ISOP are granted at fair market value\nat the date of grant. In the past, the Committee has recommended and the Board\nof Directors has granted options under the ISOP to each of the senior\nexecutives, except Mr. David. The options granted under the ISOP were\nexercisable at a rate of 11% per year for the first eight years of service after\ngrant and 12% for the ninth year after grant. No options have been granted to\nthe Company's senior executives under the ISOP since 1986 and no further options\nmay be granted under the ISOP. The 1983 ISOP has expired.\n\nOn July 15, 1994, the Committee adopted a new Incentive Stock Option Plan (the\n\"1994 ISOP\") to replace the expired 1983 ISOP. All of the Company's management\nand administrative employees are eligible to receive grants under the 1994 ISOP.\nSubject to shareholder approval, options under the 1994 ISOP were granted to\neach of the Company's senior executives (except Mark M. David) on July 15, 1994\nat fair market value at that date. As a condition to the grant of options to the\nCompany's senior executives, the Committee required each of the recipients to\nsurrender for cancellation any interest in options granted prior to July 15,\n1994. The 1994 ISOP was approved by the Company's shareholders at the Company's\nannual meeting on December 8, 1994.\n\nIn addition to the ISOP, in 1988, the Committee recommended and the Board of\nDirectors adopted a non-qualified Management Option Plan (the \"1988\nNon-qualified Plan\") to provide an additional continuing form of long-term\nincentive to selected officers of the Company. The 1988 Non-qualified Plan was\napproved by the Company's shareholders at the Company's annual meeting on\nDecember 13, 1988. Generally, options under the 1988 Non-qualified Plan are\nissued with a 10-year exercise period in order to encourage the executive\nofficers to take a long-term approach to the formulation and accomplishment of\nthe Company's goals.\n\nIn January 1997, Messrs. Simon and Krat, the independent Directors serving on\nthe Committee, recommended that the Company grant new options to Mark David\nunder the 1988 Non-qualified Plan at a price equal to the market price for the\nCompany's shares on the date of the grant. As a condition to the grant of new\noptions to Mr. David under the 1988 Non-qualified Plan, the Committee required\nMr. David to surrender for cancellation any interest in options granted to him\nprior to January 29, 1997. On November 4, 1998, Mr. David voluntarily\nsurrendered his interest in the options granted under the 1988 Non-qualified\nPlan.\n\nAlso in January 1997, the independent Directors serving on the Committee\nrecommended that the Company grant new options under the 1994 ISOP to Saul\nPomerantz and Melvyn Knigin at a price equal to the market price for the\nCompany's shares on the date of the grant. The grant of new options to Messrs.\nPomerantz and Knigin was also subject to the condition that they surrender\n\n                                      III-3\n\n\n\n\nfor cancellation any interest in options granted to them prior to January 29,\n1997.\n\nIn November 1998, the independent Directors serving on the Committee recommended\nthat the Company grant new options to Messrs. Knigin and Pomerantz under the\n1994 ISOP and the 1988 Non-qualified Plan and to Mr. Rende under the 1994 ISOP.\n\nIncentive Compensation\n\nIn September 1998, the Compensation Committee adopted an incentive compensation\nplan for senior executives, other than Mr. David (the \"1998 Incentive Plan\").\nUnder the 1998 Incentive Plan, the Compensation Committee has the discretion to\naward bonus compensation to senior executives in an amount not to exceed five\n(5%) percent of any increases in income before taxes and any extraordinary\ncharges, as determined by the Compensation Committee, over the base amount of\n$1,200,000. Based on the collective efforts of Messrs. Knigin and Pomerantz, the\nCompensation Committee determined to award bonuses to them under the 1998\nIncentive Plan for fiscal year 1999. Mr. Knigin was eligible to receive\nincentive compensation equal to three (3%) percent and Mr. Pomerantz was\neligible to receive two (2%) of the available bonus compensation for fiscal\n1999.\n\nCompensation of the Chief Executive Officer\n\nFor fiscal year 1999, the annual base salary paid to Mark M. David, the\nCompany's Chairman of the Board and former Chief Executive Officer, remained at\nthe same $335,000 as he received in fiscal year 1998. Mr. Knigin became Chief\nExecutive Officer in February 1999. His annual base salary for 1999 was\n$405,406.\n\nCompensation Committee Interlocks and Insider Participation\n\nOther than the Company's Chairman of the Board, there are no Compensation\nCommittee interlocks or insider participation. Mr. David did not participate in\nthe Committee's determinations of his compensation.\n\n                           Mark M. David\n                           Gary W. Krat\n                           Joel M. Simon\n\n                                      III-4\n\n\n\n                           Summary Compensation Table\n\n",
                        {
                            "type": "table",
                            "content": [
                                {
                                    "type": "caption",
                                    "content": [
                                        "\n                                           ANNUAL                 LONG TERM COMPENSATION\n                                           COMPENSATION                         RESTRICTED\nNAMED PRINCIPAL              FISCAL        ------------        STOCK              OPTIONS         ALL OTHER\nPOSITION                     YEAR           SALARY ($)        AWARDS($)          (# SHARES)       COMPENSATION\n---------------              ----           ----------        ---------          ---------        ------------\n<S>                          <C>               <C>             <C>              <C>                <C>"
                                    ]
                                },
                                "Mark M. David                1999              340,355           -                    -(1)          508,145 (2)\nChairman of the Board        1998              335,000           -              350,000(1)            8,145 (2)\n                             1997              275,000           -              350,000(1)            8,145 (2)\n\nMelvyn Knigin                1999              405,406           -              600,000(3)           67,495\nPresident and Chief          1998              350,000           -              350,000(5)                -\nExecutive Officer of         1997              296,660           -              350,000(5)                -\nthe Company; Director\n\n\nSaul Pomerantz               1999              228,342           -              500,000(4)           44,996\nExecutive Vice President     1998              200,000           -              350,000(5)                -\nand Chief Operating          1997              164,480           -              350,000(5)                -\nOfficer of the\nCompany; Director\n\nThomas Rende                 1999              126,300           -              105,000(6)                -\nChief Financial Officer\n\n</TABLE>\n\n\n(1)  Represents options to purchase 350,000 shares of Common Stock granted On\n     January 29, 1997 under the Company's Non-Qualified Stock Option Plan (\"1988\n     Plan\"). Mr. David surrendered these options on November 4, 1998.\n\n(2)  Represents annual premiums of $8,145 paid by the Company for a split dollar\n     form of life insurance policy on the life of Mark M. David and an accrual\n     for the retirement payment made to Mr. David in connection with his\n     retirement as a full-time employee of the Company.\n\n(3)  Represents options to purchase shares of Common Stock under the 1994\n     Incentive Stock Option Plan (the \"1994 Plan\") of which 350,000 shares were\n     granted on January 29, 1997 and 125,000 were granted on November 4, 1998\n     and 125,000 shares granted on November 4, 1998 under the Company's\n     Non-Qualified Stock Option Plan (the \"1988 Plan\").\n\n(4)  Represents options to purchase shares of Common Stock under the 1994\n     Incentive Stock Option Plan (the \"1994 Plan\") of which 350,000 shares were\n     granted on January 29, 1997 and 75,000 were granted on November 4, 1998 and\n     75,000 shares granted on November 4, 1998 under the Company's Non-Qualified\n     Stock Option Plan (the \"1988 Plan\").\n\n(5)  Represents options to purchase 350,000 shares of Commo Stock granted on\n     January 29, 1997 under the 1994 Incentive Stock Option Plan (the \"1994\n     Plan\").\n\n(6)  Represents options to purchase shares of Common Stock under the 1994\n     Incentive Stock Option Plan (the \"1994 Plan\") of which 20,000 shares were\n     granted on July 15, 1994, 50,000 were granted on January 29, 1997 and\n     35,000 were granted on November 4, 1998.\n\n\n                                     III-5\n\n<PAGE>\n\n\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AS OF\n         AUGUST 31, 1999\n\n         The following table sets forth certain information as of August 31,\n         1999 with respect to the stock ownership of (i) those persons or\n         groups (as that term is used in Section 13(d)(3) of the Securities\n         Exchange Act of 1934) who beneficially own more than 5% of the\n         Company's Common Stock, (ii) each director of the Company and (iii)\n         all directors and officers of the Company as a group.\n\n\n   NAME OF BENEFICIAL OWNER       AMOUNT AND NATURE OFWNER       PERRCENT OF\n                                  BENEFICIAL OWNERSHIP             CLASS(1)\n   ------------------------       ------------------------       -------------\n\nMark M. David                           3,180,428(2)(6)             21.3744%\n136 Madison Avenue\nNew York, NY 10016\n\nRepublic National                         962,489; Direct            6.4685%\nBank as Trustee for\nthe Movie Star, Inc.\nEmployee Stock\nOwnership Plan\n452 Fifth Avenue\nNew York, NY 10018\n\nMrs. Abraham David                     1,622,959(3)(7)              10.9072%\n8710 Banyan Court\nTamarac, FL 33321\n\nMelvyn Knigin                            294,406(4)                  1.9551%\n136 Madison Avenue\nNew York, NY 10016\n\nSaul Pomerantz                           348,781(5)                  2.3042%\n136 Madison Avenue\nNew York, NY 10016\n\nThomas Rende                             205,300(12)                 1.3760%\n136 Madison Avenue\nNew York, NY 10016\n\n\nJoel M. Simon                             74,166(10)                 0.4984%\n136 Madison Avenue\nNew York, NY 10016\n\nGary W. Krat                             253,333(11)                 1.7025%\n733 Third Avenue\nNew York, NY 10017\n\nAbraham David                             25,000; Direct(9)          0.1680%\n8710 Banyan Court\nTamarac, FL 33321\n\nAll directors and officers\n  as a group                           5,979,373(2)(4)(5)(8)(10)     39.0127%\n(6 persons)                                      (11)(12)\n\n                                      III-6\n\n\n\n-----------------\n\n(1)  Based upon 14,879,644 shares (excluding 2,016,802 treasury shares)\n     outstanding and options, where applicable, to purchase shares of Common\n     Stock, exercisable within 60 days.\n\n(2)  Includes 30,000 shares owned as trustee for his children 30,000 shares\n     owned as trustee for his sisters' children and 26,560 shares owned by his\n     spouse.\n\n(3)  Includes 606,695 shares owned by Annie David as a truste for the benefit of\n     her daughters, Marcia Sussman and Elaine Greenberg and her grandchildren,\n     Adam David, Evan David, Michael Sussman and David Greenberg.\n\n(4)  Includes options granted to Melvyn Knigin for 178,906 shares pursuant to\n     the 1994 Plan, exercisable within 60 days and 100,000 shares subject to the\n     Affiliates Agreement (see Item 13(a))\n\n(5)  Includes options granted to Saul Pomerantz for 226,871 shares and Shelley\n     Pomerantz for 30,000 shares (his wife who also is employed by the Company)\n     pursuant to the 1994 Plan, exercisable within 60 days, 66,666 shares\n     subject to the Affiliates Agreement (see Item 13(a)); and 244 shares owned\n     by his spouse and 8,000 shares held jointly with his spouse.\n\n(6)  Does not include Mrs. Abraham David's shares for which h holds the proxy.\n\n(7)  Mark M. David holds a proxy for these shares.\n\n(8)  Includes the shares held by Mrs. Abraham David.\n\n(9)  Abraham David is the husband of Annie David and the father of Mark M.\n     David.\n\n(10) Includes 26,666 shares subject to the Affiliates Agreement (see Item\n     13(a)).\n\n(11) Includes 233,333 shares subject to the Affiliates Agreement (see Item\n     13(a)).\n\n(12) Represents options granted to Thomas Rende for 40,000 shares, pursuant to\n     the 1994 Plan, exercisable within 60 days, 46,000 shares held jointly with\n     his spouse, 3,300 shares owned by his spouse and 116,000 shares subject to\n     the Affiliates Agreement (see Item 13(a)).\n\n\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS\n\n(a)  In December 1997, certain of the officers and directors of the Company\n     (other than Mr. David), the Company's counsel and/or members of their\n     families (collectively, the \"Affiliates\"), purchased from unrelated third\n     parties 8% Convertible Senior Notes of the Company in the aggregate face\n     amount of $278,500 (the \"Notes\"). The Affiliates entered into a written\n     Agreement with the Company dated December 7, 1997 (the \"Affiliates\n     Agreement\") pursuant to which they agreed to (i) certain restrictions on\n     the circumstances under which the Notes and the shares of Common Stock\n     underlying the Notes could be sold or transferred, and (ii) granted the\n     Company the right to purchase the shares of Common Stock underlying the\n     Notes at a price equal to ninety (90%) of the market price at the time any\n     of the Affiliates is permitted under the Affiliates Agreement to sell the\n     shares of Common Stock in the open market and wishes to do so. As required\n     by the Affiliates Agreement, all of the Affiliates converted the Notes into\n     shares of Common Stock on March 31, 1999.\n\n(b)  Effective as of July 1, 1999, Mr. David retired as a full-time executive\n     employee of the Company. The Company and Mr. David have entered into a\n     series of written agreements which provide for the payment to Mr. David of\n     a lump sum retirement benefit of $500,000, the continuation of health\n     insurance benefits and a split dollar life insurance policy on Mr. David's\n     life and the retention of Mr. David's services as a consultant to the\n     Company for a term of five years. Pursuant to the consulting agreement, Mr.\n     David is prohibited from disclosing any confidential information of the\n     Company and from engaging in any business which is competitive with the\n     business of the Company.\n\n\n                                     III-7",
                                {
                                    "type": "part",
                                    "content": [
                                        "\n\nITEM 14. EXHIBITS, FINANCIAL STATEMENT SCHEDULES AND REPORTS ON FORM 8-K\n\n                                                                        Page\n\n(a)   1.     Financial Statements and Supplementary Data\n\n             Included in Part II, Item 8 of this report:\n\n               Independent Auditors' Report                             F-1\n\n               Consolidated Balance Sheets at June 30, 1999\n               and 1998                                                 F-2\n\n               Consolidated Statements of Income for the fiscal\n               years ended June 30, 1999, 1998 and 1997                 F-3\n\n               Consolidated Statements of Stockholders' Equity for\n               the fiscal years ended June 30, 1999, 1998 and 1997      F-4\n\n               Consolidated Statements of Cash Flows for the fiscal\n               years ended June 30, 1999, 1998 and 1997              F-5 - F-6\n\n               Notes to Consolidated Financial Statements            F-7 - F-19\n\n      2.     Schedule\n\n             For the fiscal years ended June 30, 1999, 1998 and 1997:\n\n                    II - Valuation and Qualifying Accounts              S-1\n\n\nSchedules other than those listed above are omitted for the reason that they are\nnot required or are not applicable, or the required information is shown in the\nfinancial statements or notes thereto. Columns omitted from schedules filed have\nbeen omitted because the information is not applicable.\n\n\n                                      IV-1\n\n\n\n      (a)  3.  EXHIBITS",
                                        {
                                            "type": "table",
                                            "content": [
                                                "     Exhibit\n     Number              Exhibit                                      Method of Filing\n     --------            ----------------------                       ------------------------\n<S>                     <C>                                           <C>\n     3.1                 Certificate of Incorporation                 Incorporated by reference\n                                                                      to Form 10-K for fiscal\n                                                                      year ended June 30, 1988\n                                                                      and filed on October 13,\n                                                                      1988.\n\n     3.1.1               Amended Certificate of                       Incorporated by reference\n                         Incorporation                                to Form 10-K for fiscal\n                                                                      year ended June 30, 1992\n                                                                      and filed on September 25,\n                                                                      1992.\n\n     3.1.2               Amended Certificate of                       Incorporated by reference\n                         Incorporation                                to Form 8 Amendment to\n                                                                      Form  10-K for fiscal\n                                                                      year ended June   30,\n                                                                      1992   and filed   on\n                                                                      January 19, 1993.\n\n     3.2                 By-Laws                                      Incorporated by reference\n                                                                      to Form 10-K for fiscal\n                                                                      year ended June 30, 1988\n                                                                      and filed on October 13,\n                                                                      1988.\n\n     4.1                 Instruments defining the                     Incorporated by reference\n                         rights of security holders                   to Exhibits to\n                         including indentures                         Registration Statement on\n                                                                      Form S-2 (No. 33-7837)\n                                                                      filed October 10, 1986.\n\n     4.1.1               Indenture dated as of October                Incorporated by reference\n                         1, 1996 between the                          to Exhibits to Application\n                         Company, as Issuer and                       for Qualification of\n                         American Stock Transfer &                    Indenture under the Trust\n                         Trust Company, as Trustee                    Indenture Act of 1939 on\n                                                                      Form T-3 (Commission File\n                                                                      No. 22-22243) filed on\n                                                                      September 13, 1996.\n\n     4.2                 Plan of Merger dated November                Incorporated by reference\n                         18, 1980, between Stardust                   to Exhibits to\n                         Inc. and Sanmark Industries                  Registration Statement on\n                         Inc. whereby Sanmark                         Form S-14 (Registration\n                         Industries Inc. was merged                   No. 2-70365) filed by\n                         into Stardust Inc.                           Company's predecessor\n                                                                      corporation, Stardust Inc.\n                                                                      on February 12, 1981.\n\n</TABLE>\n\n                                                      IV-2\n\n\n\n<TABLE>\n     Exhibit\n     Number              Exhibit                                      Method of Filing\n     --------            ----------------------                       ------------------------\n<S>                     <C>                                           <C>\n     10.1                Agreement of Sale dated                      Incorporated by reference\n                         December 12, 1983, as amended                to Exhibits to\n                         January 31, 1984, among                      Registration Statement\n                         Industrial Development                       Form S-2 (No. 33-7837)\n                         Authority of Russell County                  filed October 10, 1986.\n                         (Virginia), the Company and the\n                         Bankers Trust Company,\n                         with  attendant  Deed and Bill\n                         of Sale,  Deed of Trust,\n                         Assignment, and Promissory Note\n                         in  the  sum  of $3,000,000.\n\n     10.2                Employee Stock Ownership and                 Incorporated by reference\n                         Capital Accumulation Plan                    to Exhibits to\n                         dated April 17, 1984 as                      Registration Statement\n                         amended on July 1, 1984                      Form S-2 (No. 33-7837)\n                         between Republic National                    filed October 10, 1986.\n                         Bank of New York, as trustee,\n                         and the Company.\n\n     10.3                Incentive Stock Option Plan                  Incorporated by reference\n                         Agreement dated June 28,                     to Exhibits to\n                         1983, as amended on January                  Registration Statement\n                         13, 1986.                                    Form S-2 (No. 33-7837)\n                                                                      filed October 10, 1986.\n\n     10.3.1              1994 Incentive Stock Option                  Incorporated by reference\n                         Plan.                                        to Form 10-K for fiscal\n                                                                      year ended June 30, 1994\n                                                                      and filed on October 12,\n                                                                      1994.\n\n     10.4                Form of Non-Qualified Stock                  Incorporated by reference\n                         Option granted to several                    to Exhibits to\n                         persons who are                              Registration Statement\n                         manufacturer's                               Form S-2 (No. 33-7837)\n                         representatives for the                      filed October 10, 1986.\n                         Company.\n\n     10.5                Financing Agreement dated as                 Incorporated by reference\n                         of April 24, 1996 between                    to Form 10-Q for the\n                         Rosenthal & Rosenthal, Inc.                  quarter ended March 30,\n                         and the Company.                             1996 and filed on May 15, 1996.\n\n     10.5.1              Side Letter re Covenants                     Incorporated by reference\n                         dated as of April 24, 1996                   to Form 10-Q for the\n                         with Rosenthal & Rosenthal,                  quarter ended March 30,\n                         Inc.                                         1996 and filed on\n                                                                      May 15, 1996.\n\n</TABLE>\n\n                                      IV-3\n\n<PAGE>\n\n<TABLE>\n     Exhibit\n     Number              Exhibit                                      Method of Filing\n     --------            ----------------------                       ------------------------\n<S>                     <C>                                           <C>\n     10.5.2              Security Agreement dated as                  Incorporated by reference\n                         of April 24, 1996 between                    to Form 10-Q for the\n                         Rosenthal & Rosenthal, Inc.                  quarter ended March 30,\n                         and the Company.                             1996 and filed on\n                                                                      May 15, 1996.\n\n     10.5.3              Security Agreement -                         Incorporated by reference\n                         Inventory dated as of April                  to Form 10-Q for the\n                         24, 1996 between Rosenthal &                 quarter ended March 30,\n                         Rosenthal, Inc. and the                      1996 and filed on\n                         Company.                                     May 15, 1996.\n\n     10.5.4              Security Agreement and                       Incorporated by reference\n                         Mortgage - Trademarks dated                  to Form 10-Q for the\n                         as of April 24, 1996 between                 quarter ended March 30,\n                         Rosenthal & Rosenthal, inc.                  1996 and filed on\n                         and the Company.                             May 15, 1996.\n\n     10.5.5              Negative Pledge - Real                       Incorporated by reference\n                         property dated as of April                   to Form 10-Q for the\n                         24, 1996 between Rosenthal &                 quarter ended March 30,\n                         Rosenthal, Inc. and the                      1996 and filed on\n                         Company.                                     May 15, 1996.\n\n     10.5.6              Assignment of Leases, Rents                  Incorporated by reference\n                         and Security Deposits dated                  to Form 10-Q for the\n                         as of April 24, 1996 between                 quarter ended March 30,\n                         Rosenthal & Rosenthal, Inc.                  1996 and filed on\n                         and the Company.                             May 15, 1996.\n\n     10.5.7              Letter Agreement dated as of                 Filed herewith.\n                         June 28, 1999 between Rosenthal &\n                         Rosenthal, Inc. and the Company\n                         Modifying and extending the Financing\n                         Agreement dated April 26, 1996\n\n     10.7                1988 Non-Qualified Stock                     Incorporated by reference\n                         Option Plan.                                 to Form 10-K for fiscal\n                                                                      year ended June 30, 1989\n                                                                      and filed on September 27,\n                                                                      1989.\n\n     10.8                License Agreement dated                      Incorporated by reference\n                         July 26, 1990 between PGH                    to Form 8 Amendment to\n                         Company, Licensor and                        Form 10-K for fiscal year\n                         Sanmark-Stardust Inc.                        ended June 30, 1992 and\n                         Licensee.                                    filed on January 19, 1993.\n\n     10.9                License Agreement dated                      Incorporated by reference\n                         November 14, 1991 between                    to Form 8 Amendment to\n                         BonJour Group, Ltd., Licensor                Form 10-K for fiscal year\n                         and Sanmark-Stardust Inc.,                   ended June 30, 1992 and\n                         Licensee.                                    Filed on January 19, 1993.\n\n</TABLE>\n\n                                                         IV-4\n\n<PAGE>\n\n<TABLE>\n     Exhibit\n     Number              Exhibit                                      Method of Filing\n     --------            ----------------------                       ------------------------\n<S>                     <C>                                           <C>\n     10.10               Prototype of Contract of                     Incorporated by reference\n                         Purchase periodically entered                to Form 10-K for fiscal\n                         into between the Company                     year ended June 30, 1993\n                         and Sears Roebuck and                        and filed on September 18,\n                         Company.                                     1993.\n\n\n     10.11               Agreement dated as of July 1, 1999           Filed herewith\n                         between Mark M. David and the Company\n                         providing for retirement benefits\n                         Mr. David.\n\n     10.12               Agreement dated as of July 1, 1999           Filed herewith\n                         between Mark M. David and the Company\n                         for Mr. David's consulting services.\n\n     21                  Subsidiaries of the Company.                 Filed herewith.\n\n     23                  Independent Auditors' Consent                Filed herewith.\n\n     27                  Financial Data Schedule                      Filed herewith.\n\n     28.1                Tender Offer Statement and                   Incorporated by reference\n                         Rule 13E-3 Transaction                       to Schedule 14D-1 and Rule\n                         Statement with respect to                    13E-3 Transaction\n                         Movie Star, Inc. Acquisition.                Statement (No. 1-4585)\n                                                                      filed December 18, 1987."
                                            ]
                                        },
                                        "\n\n     (a)      4.  Report on Form 8-K\n\n    None.\n\n\n                                      IV-5\n\n<PAGE>\n\n\nSIGNATURES\n\n     Pursuant to the requirements of Section 13 or 15(d) of the Securities and\nExchange Act of 1934, the Company has duly caused this document to be signed on\nits behalf by the undersigned, thereunto duly authorized.\n\nSeptember 28, 1999\n\n                                        MOVIE STAR, INC.\n\n                                        By:   /s/ MARK M. DAVID\n                                        --------------------------------\n                                              MARK M. DAVID, Chairman\n                                              of the Board\n\n\nPursuant to the  requirements  of the Securities and Exchange Act of 1934,  this\nreport has been signed below by the  following  persons on behalf of the Company\nand in the capacities and as of the date indicated.\n\n<TABLE>\n<S>                                  <C>                                   <C>\n/s/   MARK M. DAVID                   Chairman of the Board                September 28, 1999\n-------------------------------\nMARK M. DAVID\n\n/s/   MELVYN KNIGIN                   President; Executive Officer;        September 28, 1999\n-------------------------------       Director\nMELVYN KNIGIN\n\n/s/   SAUL POMERANTZ                  Executive Vice President;            September 28, 1999\n-------------------------------       Chief Operating Officer;\nSAUL POMERANTZ                        Secretary & Director\n\n/s/ THOMAS RENDE                      Principal Financial &                September 28, 1999\n-------------------------------       Accounting Officer\nTHOMAS RENDE\n\n/s/   GARY W. KRAT                    Director                             September 28, 1999\n-------------------------------\nGARY W. KRAT\n\n\n/s/  JOEL M. SIMON                    Director                             September 28, 1999\n-------------------------------\nJOEL M. SIMON\n\n\n</TABLE>\n\n\n                                      IV-6\n\n<PAGE>\n\n                                  EXHIBIT INDEX\n\n\nEXHIBIT NO.                       DESCRIPTION\n\n      21                SUBSIDIARIES OF THE COMPANY\n\n      23                INDEPENDENT AUDITORS' CONSENT"
                                    ]
                                }
                            ]
                        },
                        "\n\n     (a)      4.  Report on Form 8-K\n\n    None.\n\n\n                                      IV-5\n\n<PAGE>\n\n\nSIGNATURES\n\n     Pursuant to the requirements of Section 13 or 15(d) of the Securities and\nExchange Act of 1934, the Company has duly caused this document to be signed on\nits behalf by the undersigned, thereunto duly authorized.\n\nSeptember 28, 1999\n\n                                        MOVIE STAR, INC.\n\n                                        By:   /s/ MARK M. DAVID\n                                        --------------------------------\n                                              MARK M. DAVID, Chairman\n                                              of the Board\n\n\nPursuant to the  requirements  of the Securities and Exchange Act of 1934,  this\nreport has been signed below by the  following  persons on behalf of the Company\nand in the capacities and as of the date indicated.\n\n<TABLE>\n<S>                                  <C>                                   <C>\n/s/   MARK M. DAVID                   Chairman of the Board                September 28, 1999\n-------------------------------\nMARK M. DAVID\n\n/s/   MELVYN KNIGIN                   President; Executive Officer;        September 28, 1999\n-------------------------------       Director\nMELVYN KNIGIN\n\n/s/   SAUL POMERANTZ                  Executive Vice President;            September 28, 1999\n-------------------------------       Chief Operating Officer;\nSAUL POMERANTZ                        Secretary & Director\n\n/s/ THOMAS RENDE                      Principal Financial &                September 28, 1999\n-------------------------------       Accounting Officer\nTHOMAS RENDE\n\n/s/   GARY W. KRAT                    Director                             September 28, 1999\n-------------------------------\nGARY W. KRAT\n\n\n/s/  JOEL M. SIMON                    Director                             September 28, 1999\n-------------------------------\nJOEL M. SIMON\n\n\n</TABLE>\n\n\n                                      IV-6\n\n<PAGE>\n\n                                  EXHIBIT INDEX\n\n\nEXHIBIT NO.                       DESCRIPTION\n\n      21                SUBSIDIARIES OF THE COMPANY\n\n      23                INDEPENDENT AUDITORS' CONSENT\n\n      27                FINANCIAL DATA SCHEDULE"
                    ]
                }
            ]
        }
    ]
}